Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH10_DADR.
* To use register names with standard convension, please use DMA_CH10_DADR.
*/
#define	DMA_DADR010	(DMA_CH10_DADR)

/** \brief  2140, DMA Channel Read Data CRC Register */
#define DMA_CH10_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012140u)

/** Alias (User Manual Name) for DMA_CH10_RDCRCR.
* To use register names with standard convension, please use DMA_CH10_RDCRCR.
*/
#define	DMA_RDCRCR010	(DMA_CH10_RDCRCR)

/** \brief  2148, DMA Channel Source Address Register */
#define DMA_CH10_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012148u)

/** Alias (User Manual Name) for DMA_CH10_SADR.
* To use register names with standard convension, please use DMA_CH10_SADR.
*/
#define	DMA_SADR010	(DMA_CH10_SADR)

/** \brief  2144, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH10_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012144u)

/** Alias (User Manual Name) for DMA_CH10_SDCRCR.
* To use register names with standard convension, please use DMA_CH10_SDCRCR.
*/
#define	DMA_SDCRCR010	(DMA_CH10_SDCRCR)

/** \brief  2158, DMA Channel Shadow Address Register */
#define DMA_CH10_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012158u)

/** Alias (User Manual Name) for DMA_CH10_SHADR.
* To use register names with standard convension, please use DMA_CH10_SHADR.
*/
#define	DMA_SHADR010	(DMA_CH10_SHADR)

/** \brief  2DD0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH110_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012DD0u)

/** Alias (User Manual Name) for DMA_CH110_ADICR.
* To use register names with standard convension, please use DMA_CH110_ADICR.
*/
#define	DMA_ADICR110	(DMA_CH110_ADICR)

/** \brief  2DD4, DMA Channel Configuration Register */
#define DMA_CH110_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012DD4u)

/** Alias (User Manual Name) for DMA_CH110_CHCFGR.
* To use register names with standard convension, please use DMA_CH110_CHCFGR.
*/
#define	DMA_CHCFGR110	(DMA_CH110_CHCFGR)

/** \brief  2DDC, DMARAM Channel Control and Status Register */
#define DMA_CH110_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012DDCu)

/** Alias (User Manual Name) for DMA_CH110_CHCSR.
* To use register names with standard convension, please use DMA_CH110_CHCSR.
*/
#define	DMA_CHCSR110	(DMA_CH110_CHCSR)

/** \brief  2DCC, DMA Channel Destination Address Register x */
#define DMA_CH110_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012DCCu)

/** Alias (User Manual Name) for DMA_CH110_DADR.
* To use register names with standard convension, please use DMA_CH110_DADR.
*/
#define	DMA_DADR110	(DMA_CH110_DADR)

/** \brief  2DC0, DMA Channel Read Data CRC Register */
#define DMA_CH110_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012DC0u)

/** Alias (User Manual Name) for DMA_CH110_RDCRCR.
* To use register names with standard convension, please use DMA_CH110_RDCRCR.
*/
#define	DMA_RDCRCR110	(DMA_CH110_RDCRCR)

/** \brief  2DC8, DMA Channel Source Address Register */
#define DMA_CH110_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012DC8u)

/** Alias (User Manual Name) for DMA_CH110_SADR.
* To use register names with standard convension, please use DMA_CH110_SADR.
*/
#define	DMA_SADR110	(DMA_CH110_SADR)

/** \brief  2DC4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH110_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012DC4u)

/** Alias (User Manual Name) for DMA_CH110_SDCRCR.
* To use register names with standard convension, please use DMA_CH110_SDCRCR.
*/
#define	DMA_SDCRCR110	(DMA_CH110_SDCRCR)

/** \brief  2DD8, DMA Channel Shadow Address Register */
#define DMA_CH110_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012DD8u)

/** Alias (User Manual Name) for DMA_CH110_SHADR.
* To use register names with standard convension, please use DMA_CH110_SHADR.
*/
#define	DMA_SHADR110	(DMA_CH110_SHADR)

/** \brief  2DF0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH111_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012DF0u)

/** Alias (User Manual Name) for DMA_CH111_ADICR.
* To use register names with standard convension, please use DMA_CH111_ADICR.
*/
#define	DMA_ADICR111	(DMA_CH111_ADICR)

/** \brief  2DF4, DMA Channel Configuration Register */
#define DMA_CH111_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012DF4u)

/** Alias (User Manual Name) for DMA_CH111_CHCFGR.
* To use register names with standard convension, please use DMA_CH111_CHCFGR.
*/
#define	DMA_CHCFGR111	(DMA_CH111_CHCFGR)

/** \brief  2DFC, DMARAM Channel Control and Status Register */
#define DMA_CH111_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012DFCu)

/** Alias (User Manual Name) for DMA_CH111_CHCSR.
* To use register names with standard convension, please use DMA_CH111_CHCSR.
*/
#define	DMA_CHCSR111	(DMA_CH111_CHCSR)

/** \brief  2DEC, DMA Channel Destination Address Register x */
#define DMA_CH111_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012DECu)

/** Alias (User Manual Name) for DMA_CH111_DADR.
* To use register names with standard convension, please use DMA_CH111_DADR.
*/
#define	DMA_DADR111	(DMA_CH111_DADR)

/** \brief  2DE0, DMA Channel Read Data CRC Register */
#define DMA_CH111_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012DE0u)

/** Alias (User Manual Name) for DMA_CH111_RDCRCR.
* To use register names with standard convension, please use DMA_CH111_RDCRCR.
*/
#define	DMA_RDCRCR111	(DMA_CH111_RDCRCR)

/** \brief  2DE8, DMA Channel Source Address Register */
#define DMA_CH111_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012DE8u)

/** Alias (User Manual Name) for DMA_CH111_SADR.
* To use register names with standard convension, please use DMA_CH111_SADR.
*/
#define	DMA_SADR111	(DMA_CH111_SADR)

/** \brief  2DE4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH111_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012DE4u)

/** Alias (User Manual Name) for DMA_CH111_SDCRCR.
* To use register names with standard convension, please use DMA_CH111_SDCRCR.
*/
#define	DMA_SDCRCR111	(DMA_CH111_SDCRCR)

/** \brief  2DF8, DMA Channel Shadow Address Register */
#define DMA_CH111_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012DF8u)

/** Alias (User Manual Name) for DMA_CH111_SHADR.
* To use register names with standard convension, please use DMA_CH111_SHADR.
*/
#define	DMA_SHADR111	(DMA_CH111_SHADR)

/** \brief  2E10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH112_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E10u)

/** Alias (User Manual Name) for DMA_CH112_ADICR.
* To use register names with standard convension, please use DMA_CH112_ADICR.
*/
#define	DMA_ADICR112	(DMA_CH112_ADICR)

/** \brief  2E14, DMA Channel Configuration Register */
#define DMA_CH112_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E14u)

/** Alias (User Manual Name) for DMA_CH112_CHCFGR.
* To use register names with standard convension, please use DMA_CH112_CHCFGR.
*/
#define	DMA_CHCFGR112	(DMA_CH112_CHCFGR)

