Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** \brief  217C, DMARAM Channel Control and Status Register */
#define DMA_CH11_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001217Cu)

/** Alias (User Manual Name) for DMA_CH11_CHCSR.
* To use register names with standard convension, please use DMA_CH11_CHCSR.
*/
#define	DMA_CHCSR011	(DMA_CH11_CHCSR)

/** \brief  216C, DMA Channel Destination Address Register x */
#define DMA_CH11_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001216Cu)

/** Alias (User Manual Name) for DMA_CH11_DADR.
* To use register names with standard convension, please use DMA_CH11_DADR.
*/
#define	DMA_DADR011	(DMA_CH11_DADR)

/** \brief  2160, DMA Channel Read Data CRC Register */
#define DMA_CH11_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012160u)

/** Alias (User Manual Name) for DMA_CH11_RDCRCR.
* To use register names with standard convension, please use DMA_CH11_RDCRCR.
*/
#define	DMA_RDCRCR011	(DMA_CH11_RDCRCR)

/** \brief  2168, DMA Channel Source Address Register */
#define DMA_CH11_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012168u)

/** Alias (User Manual Name) for DMA_CH11_SADR.
* To use register names with standard convension, please use DMA_CH11_SADR.
*/
#define	DMA_SADR011	(DMA_CH11_SADR)

/** \brief  2164, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH11_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012164u)

/** Alias (User Manual Name) for DMA_CH11_SDCRCR.
* To use register names with standard convension, please use DMA_CH11_SDCRCR.
*/
#define	DMA_SDCRCR011	(DMA_CH11_SDCRCR)

/** \brief  2178, DMA Channel Shadow Address Register */
#define DMA_CH11_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012178u)

/** Alias (User Manual Name) for DMA_CH11_SHADR.
* To use register names with standard convension, please use DMA_CH11_SHADR.
*/
#define	DMA_SHADR011	(DMA_CH11_SHADR)

/** \brief  2F10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH120_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F10u)

/** Alias (User Manual Name) for DMA_CH120_ADICR.
* To use register names with standard convension, please use DMA_CH120_ADICR.
*/
#define	DMA_ADICR120	(DMA_CH120_ADICR)

/** \brief  2F14, DMA Channel Configuration Register */
#define DMA_CH120_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F14u)

/** Alias (User Manual Name) for DMA_CH120_CHCFGR.
* To use register names with standard convension, please use DMA_CH120_CHCFGR.
*/
#define	DMA_CHCFGR120	(DMA_CH120_CHCFGR)

/** \brief  2F1C, DMARAM Channel Control and Status Register */
#define DMA_CH120_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F1Cu)

/** Alias (User Manual Name) for DMA_CH120_CHCSR.
* To use register names with standard convension, please use DMA_CH120_CHCSR.
*/
#define	DMA_CHCSR120	(DMA_CH120_CHCSR)

/** \brief  2F0C, DMA Channel Destination Address Register x */
#define DMA_CH120_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F0Cu)

/** Alias (User Manual Name) for DMA_CH120_DADR.
* To use register names with standard convension, please use DMA_CH120_DADR.
*/
#define	DMA_DADR120	(DMA_CH120_DADR)

/** \brief  2F00, DMA Channel Read Data CRC Register */
#define DMA_CH120_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F00u)

/** Alias (User Manual Name) for DMA_CH120_RDCRCR.
* To use register names with standard convension, please use DMA_CH120_RDCRCR.
*/
#define	DMA_RDCRCR120	(DMA_CH120_RDCRCR)

/** \brief  2F08, DMA Channel Source Address Register */
#define DMA_CH120_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F08u)

/** Alias (User Manual Name) for DMA_CH120_SADR.
* To use register names with standard convension, please use DMA_CH120_SADR.
*/
#define	DMA_SADR120	(DMA_CH120_SADR)

/** \brief  2F04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH120_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F04u)

/** Alias (User Manual Name) for DMA_CH120_SDCRCR.
* To use register names with standard convension, please use DMA_CH120_SDCRCR.
*/
#define	DMA_SDCRCR120	(DMA_CH120_SDCRCR)

/** \brief  2F18, DMA Channel Shadow Address Register */
#define DMA_CH120_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F18u)

/** Alias (User Manual Name) for DMA_CH120_SHADR.
* To use register names with standard convension, please use DMA_CH120_SHADR.
*/
#define	DMA_SHADR120	(DMA_CH120_SHADR)

/** \brief  2F30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH121_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F30u)

/** Alias (User Manual Name) for DMA_CH121_ADICR.
* To use register names with standard convension, please use DMA_CH121_ADICR.
*/
#define	DMA_ADICR121	(DMA_CH121_ADICR)

/** \brief  2F34, DMA Channel Configuration Register */
#define DMA_CH121_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F34u)

/** Alias (User Manual Name) for DMA_CH121_CHCFGR.
* To use register names with standard convension, please use DMA_CH121_CHCFGR.
*/
#define	DMA_CHCFGR121	(DMA_CH121_CHCFGR)

/** \brief  2F3C, DMARAM Channel Control and Status Register */
#define DMA_CH121_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F3Cu)

/** Alias (User Manual Name) for DMA_CH121_CHCSR.
* To use register names with standard convension, please use DMA_CH121_CHCSR.
*/
#define	DMA_CHCSR121	(DMA_CH121_CHCSR)

/** \brief  2F2C, DMA Channel Destination Address Register x */
#define DMA_CH121_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F2Cu)

/** Alias (User Manual Name) for DMA_CH121_DADR.
* To use register names with standard convension, please use DMA_CH121_DADR.
*/
#define	DMA_DADR121	(DMA_CH121_DADR)

/** \brief  2F20, DMA Channel Read Data CRC Register */
#define DMA_CH121_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F20u)

/** Alias (User Manual Name) for DMA_CH121_RDCRCR.
* To use register names with standard convension, please use DMA_CH121_RDCRCR.
*/
#define	DMA_RDCRCR121	(DMA_CH121_RDCRCR)

/** \brief  2F28, DMA Channel Source Address Register */
#define DMA_CH121_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F28u)

/** Alias (User Manual Name) for DMA_CH121_SADR.
* To use register names with standard convension, please use DMA_CH121_SADR.
*/
#define	DMA_SADR121	(DMA_CH121_SADR)

/** \brief  2F24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH121_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F24u)

/** Alias (User Manual Name) for DMA_CH121_SDCRCR.
* To use register names with standard convension, please use DMA_CH121_SDCRCR.
*/
#define	DMA_SDCRCR121	(DMA_CH121_SDCRCR)

