Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** \brief  2F38, DMA Channel Shadow Address Register */
#define DMA_CH121_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F38u)

/** Alias (User Manual Name) for DMA_CH121_SHADR.
* To use register names with standard convension, please use DMA_CH121_SHADR.
*/
#define	DMA_SHADR121	(DMA_CH121_SHADR)

/** \brief  2F50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH122_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F50u)

/** Alias (User Manual Name) for DMA_CH122_ADICR.
* To use register names with standard convension, please use DMA_CH122_ADICR.
*/
#define	DMA_ADICR122	(DMA_CH122_ADICR)

/** \brief  2F54, DMA Channel Configuration Register */
#define DMA_CH122_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F54u)

/** Alias (User Manual Name) for DMA_CH122_CHCFGR.
* To use register names with standard convension, please use DMA_CH122_CHCFGR.
*/
#define	DMA_CHCFGR122	(DMA_CH122_CHCFGR)

/** \brief  2F5C, DMARAM Channel Control and Status Register */
#define DMA_CH122_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F5Cu)

/** Alias (User Manual Name) for DMA_CH122_CHCSR.
* To use register names with standard convension, please use DMA_CH122_CHCSR.
*/
#define	DMA_CHCSR122	(DMA_CH122_CHCSR)

/** \brief  2F4C, DMA Channel Destination Address Register x */
#define DMA_CH122_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F4Cu)

/** Alias (User Manual Name) for DMA_CH122_DADR.
* To use register names with standard convension, please use DMA_CH122_DADR.
*/
#define	DMA_DADR122	(DMA_CH122_DADR)

/** \brief  2F40, DMA Channel Read Data CRC Register */
#define DMA_CH122_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F40u)

/** Alias (User Manual Name) for DMA_CH122_RDCRCR.
* To use register names with standard convension, please use DMA_CH122_RDCRCR.
*/
#define	DMA_RDCRCR122	(DMA_CH122_RDCRCR)

/** \brief  2F48, DMA Channel Source Address Register */
#define DMA_CH122_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F48u)

/** Alias (User Manual Name) for DMA_CH122_SADR.
* To use register names with standard convension, please use DMA_CH122_SADR.
*/
#define	DMA_SADR122	(DMA_CH122_SADR)

/** \brief  2F44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH122_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F44u)

/** Alias (User Manual Name) for DMA_CH122_SDCRCR.
* To use register names with standard convension, please use DMA_CH122_SDCRCR.
*/
#define	DMA_SDCRCR122	(DMA_CH122_SDCRCR)

/** \brief  2F58, DMA Channel Shadow Address Register */
#define DMA_CH122_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F58u)

/** Alias (User Manual Name) for DMA_CH122_SHADR.
* To use register names with standard convension, please use DMA_CH122_SHADR.
*/
#define	DMA_SHADR122	(DMA_CH122_SHADR)

/** \brief  2F70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH123_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F70u)

/** Alias (User Manual Name) for DMA_CH123_ADICR.
* To use register names with standard convension, please use DMA_CH123_ADICR.
*/
#define	DMA_ADICR123	(DMA_CH123_ADICR)

/** \brief  2F74, DMA Channel Configuration Register */
#define DMA_CH123_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F74u)

/** Alias (User Manual Name) for DMA_CH123_CHCFGR.
* To use register names with standard convension, please use DMA_CH123_CHCFGR.
*/
#define	DMA_CHCFGR123	(DMA_CH123_CHCFGR)

/** \brief  2F7C, DMARAM Channel Control and Status Register */
#define DMA_CH123_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F7Cu)

/** Alias (User Manual Name) for DMA_CH123_CHCSR.
* To use register names with standard convension, please use DMA_CH123_CHCSR.
*/
#define	DMA_CHCSR123	(DMA_CH123_CHCSR)

/** \brief  2F6C, DMA Channel Destination Address Register x */
#define DMA_CH123_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F6Cu)

/** Alias (User Manual Name) for DMA_CH123_DADR.
* To use register names with standard convension, please use DMA_CH123_DADR.
*/
#define	DMA_DADR123	(DMA_CH123_DADR)

/** \brief  2F60, DMA Channel Read Data CRC Register */
#define DMA_CH123_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F60u)

/** Alias (User Manual Name) for DMA_CH123_RDCRCR.
* To use register names with standard convension, please use DMA_CH123_RDCRCR.
*/
#define	DMA_RDCRCR123	(DMA_CH123_RDCRCR)

/** \brief  2F68, DMA Channel Source Address Register */
#define DMA_CH123_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F68u)

/** Alias (User Manual Name) for DMA_CH123_SADR.
* To use register names with standard convension, please use DMA_CH123_SADR.
*/
#define	DMA_SADR123	(DMA_CH123_SADR)

/** \brief  2F64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH123_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F64u)

/** Alias (User Manual Name) for DMA_CH123_SDCRCR.
* To use register names with standard convension, please use DMA_CH123_SDCRCR.
*/
#define	DMA_SDCRCR123	(DMA_CH123_SDCRCR)

/** \brief  2F78, DMA Channel Shadow Address Register */
#define DMA_CH123_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F78u)

/** Alias (User Manual Name) for DMA_CH123_SHADR.
* To use register names with standard convension, please use DMA_CH123_SHADR.
*/
#define	DMA_SHADR123	(DMA_CH123_SHADR)

/** \brief  2F90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH124_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F90u)

/** Alias (User Manual Name) for DMA_CH124_ADICR.
* To use register names with standard convension, please use DMA_CH124_ADICR.
*/
#define	DMA_ADICR124	(DMA_CH124_ADICR)

/** \brief  2F94, DMA Channel Configuration Register */
#define DMA_CH124_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F94u)

/** Alias (User Manual Name) for DMA_CH124_CHCFGR.
* To use register names with standard convension, please use DMA_CH124_CHCFGR.
*/
#define	DMA_CHCFGR124	(DMA_CH124_CHCFGR)

