Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH30_CHCSR.
* To use register names with standard convension, please use DMA_CH30_CHCSR.
*/
#define	DMA_CHCSR030	(DMA_CH30_CHCSR)

/** \brief  23CC, DMA Channel Destination Address Register x */
#define DMA_CH30_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00123CCu)

/** Alias (User Manual Name) for DMA_CH30_DADR.
* To use register names with standard convension, please use DMA_CH30_DADR.
*/
#define	DMA_DADR030	(DMA_CH30_DADR)

/** \brief  23C0, DMA Channel Read Data CRC Register */
#define DMA_CH30_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00123C0u)

/** Alias (User Manual Name) for DMA_CH30_RDCRCR.
* To use register names with standard convension, please use DMA_CH30_RDCRCR.
*/
#define	DMA_RDCRCR030	(DMA_CH30_RDCRCR)

/** \brief  23C8, DMA Channel Source Address Register */
#define DMA_CH30_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00123C8u)

/** Alias (User Manual Name) for DMA_CH30_SADR.
* To use register names with standard convension, please use DMA_CH30_SADR.
*/
#define	DMA_SADR030	(DMA_CH30_SADR)

/** \brief  23C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH30_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00123C4u)

/** Alias (User Manual Name) for DMA_CH30_SDCRCR.
* To use register names with standard convension, please use DMA_CH30_SDCRCR.
*/
#define	DMA_SDCRCR030	(DMA_CH30_SDCRCR)

/** \brief  23D8, DMA Channel Shadow Address Register */
#define DMA_CH30_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00123D8u)

/** Alias (User Manual Name) for DMA_CH30_SHADR.
* To use register names with standard convension, please use DMA_CH30_SHADR.
*/
#define	DMA_SHADR030	(DMA_CH30_SHADR)

/** \brief  23F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH31_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00123F0u)

/** Alias (User Manual Name) for DMA_CH31_ADICR.
* To use register names with standard convension, please use DMA_CH31_ADICR.
*/
#define	DMA_ADICR031	(DMA_CH31_ADICR)

/** \brief  23F4, DMA Channel Configuration Register */
#define DMA_CH31_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00123F4u)

/** Alias (User Manual Name) for DMA_CH31_CHCFGR.
* To use register names with standard convension, please use DMA_CH31_CHCFGR.
*/
#define	DMA_CHCFGR031	(DMA_CH31_CHCFGR)

/** \brief  23FC, DMARAM Channel Control and Status Register */
#define DMA_CH31_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00123FCu)

/** Alias (User Manual Name) for DMA_CH31_CHCSR.
* To use register names with standard convension, please use DMA_CH31_CHCSR.
*/
#define	DMA_CHCSR031	(DMA_CH31_CHCSR)

/** \brief  23EC, DMA Channel Destination Address Register x */
#define DMA_CH31_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00123ECu)

/** Alias (User Manual Name) for DMA_CH31_DADR.
* To use register names with standard convension, please use DMA_CH31_DADR.
*/
#define	DMA_DADR031	(DMA_CH31_DADR)

/** \brief  23E0, DMA Channel Read Data CRC Register */
#define DMA_CH31_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00123E0u)

/** Alias (User Manual Name) for DMA_CH31_RDCRCR.
* To use register names with standard convension, please use DMA_CH31_RDCRCR.
*/
#define	DMA_RDCRCR031	(DMA_CH31_RDCRCR)

/** \brief  23E8, DMA Channel Source Address Register */
#define DMA_CH31_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00123E8u)

/** Alias (User Manual Name) for DMA_CH31_SADR.
* To use register names with standard convension, please use DMA_CH31_SADR.
*/
#define	DMA_SADR031	(DMA_CH31_SADR)

/** \brief  23E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH31_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00123E4u)

/** Alias (User Manual Name) for DMA_CH31_SDCRCR.
* To use register names with standard convension, please use DMA_CH31_SDCRCR.
*/
#define	DMA_SDCRCR031	(DMA_CH31_SDCRCR)

/** \brief  23F8, DMA Channel Shadow Address Register */
#define DMA_CH31_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00123F8u)

/** Alias (User Manual Name) for DMA_CH31_SHADR.
* To use register names with standard convension, please use DMA_CH31_SHADR.
*/
#define	DMA_SHADR031	(DMA_CH31_SHADR)

/** \brief  2410, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH32_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012410u)

/** Alias (User Manual Name) for DMA_CH32_ADICR.
* To use register names with standard convension, please use DMA_CH32_ADICR.
*/
#define	DMA_ADICR032	(DMA_CH32_ADICR)

/** \brief  2414, DMA Channel Configuration Register */
#define DMA_CH32_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012414u)

/** Alias (User Manual Name) for DMA_CH32_CHCFGR.
* To use register names with standard convension, please use DMA_CH32_CHCFGR.
*/
#define	DMA_CHCFGR032	(DMA_CH32_CHCFGR)

/** \brief  241C, DMARAM Channel Control and Status Register */
#define DMA_CH32_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001241Cu)

/** Alias (User Manual Name) for DMA_CH32_CHCSR.
* To use register names with standard convension, please use DMA_CH32_CHCSR.
*/
#define	DMA_CHCSR032	(DMA_CH32_CHCSR)

/** \brief  240C, DMA Channel Destination Address Register x */
#define DMA_CH32_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001240Cu)

/** Alias (User Manual Name) for DMA_CH32_DADR.
* To use register names with standard convension, please use DMA_CH32_DADR.
*/
#define	DMA_DADR032	(DMA_CH32_DADR)

/** \brief  2400, DMA Channel Read Data CRC Register */
#define DMA_CH32_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012400u)

/** Alias (User Manual Name) for DMA_CH32_RDCRCR.
* To use register names with standard convension, please use DMA_CH32_RDCRCR.
*/
#define	DMA_RDCRCR032	(DMA_CH32_RDCRCR)

/** \brief  2408, DMA Channel Source Address Register */
#define DMA_CH32_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012408u)

/** Alias (User Manual Name) for DMA_CH32_SADR.
* To use register names with standard convension, please use DMA_CH32_SADR.
*/
#define	DMA_SADR032	(DMA_CH32_SADR)

/** \brief  2404, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH32_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012404u)

