Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH35_CHCFGR.
* To use register names with standard convension, please use DMA_CH35_CHCFGR.
*/
#define	DMA_CHCFGR035	(DMA_CH35_CHCFGR)

/** \brief  247C, DMARAM Channel Control and Status Register */
#define DMA_CH35_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001247Cu)

/** Alias (User Manual Name) for DMA_CH35_CHCSR.
* To use register names with standard convension, please use DMA_CH35_CHCSR.
*/
#define	DMA_CHCSR035	(DMA_CH35_CHCSR)

/** \brief  246C, DMA Channel Destination Address Register x */
#define DMA_CH35_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001246Cu)

/** Alias (User Manual Name) for DMA_CH35_DADR.
* To use register names with standard convension, please use DMA_CH35_DADR.
*/
#define	DMA_DADR035	(DMA_CH35_DADR)

/** \brief  2460, DMA Channel Read Data CRC Register */
#define DMA_CH35_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012460u)

/** Alias (User Manual Name) for DMA_CH35_RDCRCR.
* To use register names with standard convension, please use DMA_CH35_RDCRCR.
*/
#define	DMA_RDCRCR035	(DMA_CH35_RDCRCR)

/** \brief  2468, DMA Channel Source Address Register */
#define DMA_CH35_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012468u)

/** Alias (User Manual Name) for DMA_CH35_SADR.
* To use register names with standard convension, please use DMA_CH35_SADR.
*/
#define	DMA_SADR035	(DMA_CH35_SADR)

/** \brief  2464, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH35_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012464u)

/** Alias (User Manual Name) for DMA_CH35_SDCRCR.
* To use register names with standard convension, please use DMA_CH35_SDCRCR.
*/
#define	DMA_SDCRCR035	(DMA_CH35_SDCRCR)

/** \brief  2478, DMA Channel Shadow Address Register */
#define DMA_CH35_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012478u)

/** Alias (User Manual Name) for DMA_CH35_SHADR.
* To use register names with standard convension, please use DMA_CH35_SHADR.
*/
#define	DMA_SHADR035	(DMA_CH35_SHADR)

/** \brief  2490, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH36_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012490u)

/** Alias (User Manual Name) for DMA_CH36_ADICR.
* To use register names with standard convension, please use DMA_CH36_ADICR.
*/
#define	DMA_ADICR036	(DMA_CH36_ADICR)

/** \brief  2494, DMA Channel Configuration Register */
#define DMA_CH36_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012494u)

/** Alias (User Manual Name) for DMA_CH36_CHCFGR.
* To use register names with standard convension, please use DMA_CH36_CHCFGR.
*/
#define	DMA_CHCFGR036	(DMA_CH36_CHCFGR)

/** \brief  249C, DMARAM Channel Control and Status Register */
#define DMA_CH36_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001249Cu)

/** Alias (User Manual Name) for DMA_CH36_CHCSR.
* To use register names with standard convension, please use DMA_CH36_CHCSR.
*/
#define	DMA_CHCSR036	(DMA_CH36_CHCSR)

/** \brief  248C, DMA Channel Destination Address Register x */
#define DMA_CH36_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001248Cu)

/** Alias (User Manual Name) for DMA_CH36_DADR.
* To use register names with standard convension, please use DMA_CH36_DADR.
*/
#define	DMA_DADR036	(DMA_CH36_DADR)

/** \brief  2480, DMA Channel Read Data CRC Register */
#define DMA_CH36_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012480u)

/** Alias (User Manual Name) for DMA_CH36_RDCRCR.
* To use register names with standard convension, please use DMA_CH36_RDCRCR.
*/
#define	DMA_RDCRCR036	(DMA_CH36_RDCRCR)

/** \brief  2488, DMA Channel Source Address Register */
#define DMA_CH36_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012488u)

/** Alias (User Manual Name) for DMA_CH36_SADR.
* To use register names with standard convension, please use DMA_CH36_SADR.
*/
#define	DMA_SADR036	(DMA_CH36_SADR)

/** \brief  2484, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH36_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012484u)

/** Alias (User Manual Name) for DMA_CH36_SDCRCR.
* To use register names with standard convension, please use DMA_CH36_SDCRCR.
*/
#define	DMA_SDCRCR036	(DMA_CH36_SDCRCR)

/** \brief  2498, DMA Channel Shadow Address Register */
#define DMA_CH36_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012498u)

/** Alias (User Manual Name) for DMA_CH36_SHADR.
* To use register names with standard convension, please use DMA_CH36_SHADR.
*/
#define	DMA_SHADR036	(DMA_CH36_SHADR)

/** \brief  24B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH37_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00124B0u)

/** Alias (User Manual Name) for DMA_CH37_ADICR.
* To use register names with standard convension, please use DMA_CH37_ADICR.
*/
#define	DMA_ADICR037	(DMA_CH37_ADICR)

/** \brief  24B4, DMA Channel Configuration Register */
#define DMA_CH37_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00124B4u)

/** Alias (User Manual Name) for DMA_CH37_CHCFGR.
* To use register names with standard convension, please use DMA_CH37_CHCFGR.
*/
#define	DMA_CHCFGR037	(DMA_CH37_CHCFGR)

/** \brief  24BC, DMARAM Channel Control and Status Register */
#define DMA_CH37_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00124BCu)

/** Alias (User Manual Name) for DMA_CH37_CHCSR.
* To use register names with standard convension, please use DMA_CH37_CHCSR.
*/
#define	DMA_CHCSR037	(DMA_CH37_CHCSR)

/** \brief  24AC, DMA Channel Destination Address Register x */
#define DMA_CH37_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00124ACu)

/** Alias (User Manual Name) for DMA_CH37_DADR.
* To use register names with standard convension, please use DMA_CH37_DADR.
*/
#define	DMA_DADR037	(DMA_CH37_DADR)

/** \brief  24A0, DMA Channel Read Data CRC Register */
#define DMA_CH37_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00124A0u)

/** Alias (User Manual Name) for DMA_CH37_RDCRCR.
* To use register names with standard convension, please use DMA_CH37_RDCRCR.
*/
#define	DMA_RDCRCR037	(DMA_CH37_RDCRCR)

