Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH65_SADR.
* To use register names with standard convension, please use DMA_CH65_SADR.
*/
#define	DMA_SADR065	(DMA_CH65_SADR)

/** \brief  2824, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH65_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012824u)

/** Alias (User Manual Name) for DMA_CH65_SDCRCR.
* To use register names with standard convension, please use DMA_CH65_SDCRCR.
*/
#define	DMA_SDCRCR065	(DMA_CH65_SDCRCR)

/** \brief  2838, DMA Channel Shadow Address Register */
#define DMA_CH65_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012838u)

/** Alias (User Manual Name) for DMA_CH65_SHADR.
* To use register names with standard convension, please use DMA_CH65_SHADR.
*/
#define	DMA_SHADR065	(DMA_CH65_SHADR)

/** \brief  2850, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH66_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012850u)

/** Alias (User Manual Name) for DMA_CH66_ADICR.
* To use register names with standard convension, please use DMA_CH66_ADICR.
*/
#define	DMA_ADICR066	(DMA_CH66_ADICR)

/** \brief  2854, DMA Channel Configuration Register */
#define DMA_CH66_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012854u)

/** Alias (User Manual Name) for DMA_CH66_CHCFGR.
* To use register names with standard convension, please use DMA_CH66_CHCFGR.
*/
#define	DMA_CHCFGR066	(DMA_CH66_CHCFGR)

/** \brief  285C, DMARAM Channel Control and Status Register */
#define DMA_CH66_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001285Cu)

/** Alias (User Manual Name) for DMA_CH66_CHCSR.
* To use register names with standard convension, please use DMA_CH66_CHCSR.
*/
#define	DMA_CHCSR066	(DMA_CH66_CHCSR)

/** \brief  284C, DMA Channel Destination Address Register x */
#define DMA_CH66_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001284Cu)

/** Alias (User Manual Name) for DMA_CH66_DADR.
* To use register names with standard convension, please use DMA_CH66_DADR.
*/
#define	DMA_DADR066	(DMA_CH66_DADR)

/** \brief  2840, DMA Channel Read Data CRC Register */
#define DMA_CH66_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012840u)

/** Alias (User Manual Name) for DMA_CH66_RDCRCR.
* To use register names with standard convension, please use DMA_CH66_RDCRCR.
*/
#define	DMA_RDCRCR066	(DMA_CH66_RDCRCR)

/** \brief  2848, DMA Channel Source Address Register */
#define DMA_CH66_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012848u)

/** Alias (User Manual Name) for DMA_CH66_SADR.
* To use register names with standard convension, please use DMA_CH66_SADR.
*/
#define	DMA_SADR066	(DMA_CH66_SADR)

/** \brief  2844, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH66_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012844u)

/** Alias (User Manual Name) for DMA_CH66_SDCRCR.
* To use register names with standard convension, please use DMA_CH66_SDCRCR.
*/
#define	DMA_SDCRCR066	(DMA_CH66_SDCRCR)

/** \brief  2858, DMA Channel Shadow Address Register */
#define DMA_CH66_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012858u)

/** Alias (User Manual Name) for DMA_CH66_SHADR.
* To use register names with standard convension, please use DMA_CH66_SHADR.
*/
#define	DMA_SHADR066	(DMA_CH66_SHADR)

/** \brief  2870, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH67_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012870u)

/** Alias (User Manual Name) for DMA_CH67_ADICR.
* To use register names with standard convension, please use DMA_CH67_ADICR.
*/
#define	DMA_ADICR067	(DMA_CH67_ADICR)

/** \brief  2874, DMA Channel Configuration Register */
#define DMA_CH67_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012874u)

/** Alias (User Manual Name) for DMA_CH67_CHCFGR.
* To use register names with standard convension, please use DMA_CH67_CHCFGR.
*/
#define	DMA_CHCFGR067	(DMA_CH67_CHCFGR)

/** \brief  287C, DMARAM Channel Control and Status Register */
#define DMA_CH67_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001287Cu)

/** Alias (User Manual Name) for DMA_CH67_CHCSR.
* To use register names with standard convension, please use DMA_CH67_CHCSR.
*/
#define	DMA_CHCSR067	(DMA_CH67_CHCSR)

/** \brief  286C, DMA Channel Destination Address Register x */
#define DMA_CH67_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001286Cu)

/** Alias (User Manual Name) for DMA_CH67_DADR.
* To use register names with standard convension, please use DMA_CH67_DADR.
*/
#define	DMA_DADR067	(DMA_CH67_DADR)

/** \brief  2860, DMA Channel Read Data CRC Register */
#define DMA_CH67_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012860u)

/** Alias (User Manual Name) for DMA_CH67_RDCRCR.
* To use register names with standard convension, please use DMA_CH67_RDCRCR.
*/
#define	DMA_RDCRCR067	(DMA_CH67_RDCRCR)

/** \brief  2868, DMA Channel Source Address Register */
#define DMA_CH67_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012868u)

/** Alias (User Manual Name) for DMA_CH67_SADR.
* To use register names with standard convension, please use DMA_CH67_SADR.
*/
#define	DMA_SADR067	(DMA_CH67_SADR)

/** \brief  2864, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH67_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012864u)

/** Alias (User Manual Name) for DMA_CH67_SDCRCR.
* To use register names with standard convension, please use DMA_CH67_SDCRCR.
*/
#define	DMA_SDCRCR067	(DMA_CH67_SDCRCR)

/** \brief  2878, DMA Channel Shadow Address Register */
#define DMA_CH67_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012878u)

/** Alias (User Manual Name) for DMA_CH67_SHADR.
* To use register names with standard convension, please use DMA_CH67_SHADR.
*/
#define	DMA_SHADR067	(DMA_CH67_SHADR)

/** \brief  2890, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH68_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012890u)

