Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH68_ADICR.
* To use register names with standard convension, please use DMA_CH68_ADICR.
*/
#define	DMA_ADICR068	(DMA_CH68_ADICR)

/** \brief  2894, DMA Channel Configuration Register */
#define DMA_CH68_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012894u)

/** Alias (User Manual Name) for DMA_CH68_CHCFGR.
* To use register names with standard convension, please use DMA_CH68_CHCFGR.
*/
#define	DMA_CHCFGR068	(DMA_CH68_CHCFGR)

/** \brief  289C, DMARAM Channel Control and Status Register */
#define DMA_CH68_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001289Cu)

/** Alias (User Manual Name) for DMA_CH68_CHCSR.
* To use register names with standard convension, please use DMA_CH68_CHCSR.
*/
#define	DMA_CHCSR068	(DMA_CH68_CHCSR)

/** \brief  288C, DMA Channel Destination Address Register x */
#define DMA_CH68_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001288Cu)

/** Alias (User Manual Name) for DMA_CH68_DADR.
* To use register names with standard convension, please use DMA_CH68_DADR.
*/
#define	DMA_DADR068	(DMA_CH68_DADR)

/** \brief  2880, DMA Channel Read Data CRC Register */
#define DMA_CH68_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012880u)

/** Alias (User Manual Name) for DMA_CH68_RDCRCR.
* To use register names with standard convension, please use DMA_CH68_RDCRCR.
*/
#define	DMA_RDCRCR068	(DMA_CH68_RDCRCR)

/** \brief  2888, DMA Channel Source Address Register */
#define DMA_CH68_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012888u)

/** Alias (User Manual Name) for DMA_CH68_SADR.
* To use register names with standard convension, please use DMA_CH68_SADR.
*/
#define	DMA_SADR068	(DMA_CH68_SADR)

/** \brief  2884, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH68_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012884u)

/** Alias (User Manual Name) for DMA_CH68_SDCRCR.
* To use register names with standard convension, please use DMA_CH68_SDCRCR.
*/
#define	DMA_SDCRCR068	(DMA_CH68_SDCRCR)

/** \brief  2898, DMA Channel Shadow Address Register */
#define DMA_CH68_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012898u)

/** Alias (User Manual Name) for DMA_CH68_SHADR.
* To use register names with standard convension, please use DMA_CH68_SHADR.
*/
#define	DMA_SHADR068	(DMA_CH68_SHADR)

/** \brief  28B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH69_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00128B0u)

/** Alias (User Manual Name) for DMA_CH69_ADICR.
* To use register names with standard convension, please use DMA_CH69_ADICR.
*/
#define	DMA_ADICR069	(DMA_CH69_ADICR)

/** \brief  28B4, DMA Channel Configuration Register */
#define DMA_CH69_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00128B4u)

/** Alias (User Manual Name) for DMA_CH69_CHCFGR.
* To use register names with standard convension, please use DMA_CH69_CHCFGR.
*/
#define	DMA_CHCFGR069	(DMA_CH69_CHCFGR)

/** \brief  28BC, DMARAM Channel Control and Status Register */
#define DMA_CH69_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00128BCu)

/** Alias (User Manual Name) for DMA_CH69_CHCSR.
* To use register names with standard convension, please use DMA_CH69_CHCSR.
*/
#define	DMA_CHCSR069	(DMA_CH69_CHCSR)

/** \brief  28AC, DMA Channel Destination Address Register x */
#define DMA_CH69_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00128ACu)

/** Alias (User Manual Name) for DMA_CH69_DADR.
* To use register names with standard convension, please use DMA_CH69_DADR.
*/
#define	DMA_DADR069	(DMA_CH69_DADR)

/** \brief  28A0, DMA Channel Read Data CRC Register */
#define DMA_CH69_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128A0u)

/** Alias (User Manual Name) for DMA_CH69_RDCRCR.
* To use register names with standard convension, please use DMA_CH69_RDCRCR.
*/
#define	DMA_RDCRCR069	(DMA_CH69_RDCRCR)

/** \brief  28A8, DMA Channel Source Address Register */
#define DMA_CH69_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128A8u)

/** Alias (User Manual Name) for DMA_CH69_SADR.
* To use register names with standard convension, please use DMA_CH69_SADR.
*/
#define	DMA_SADR069	(DMA_CH69_SADR)

/** \brief  28A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH69_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128A4u)

/** Alias (User Manual Name) for DMA_CH69_SDCRCR.
* To use register names with standard convension, please use DMA_CH69_SDCRCR.
*/
#define	DMA_SDCRCR069	(DMA_CH69_SDCRCR)

/** \brief  28B8, DMA Channel Shadow Address Register */
#define DMA_CH69_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00128B8u)

/** Alias (User Manual Name) for DMA_CH69_SHADR.
* To use register names with standard convension, please use DMA_CH69_SHADR.
*/
#define	DMA_SHADR069	(DMA_CH69_SHADR)

/** \brief  20D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH6_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00120D0u)

/** Alias (User Manual Name) for DMA_CH6_ADICR.
* To use register names with standard convension, please use DMA_CH6_ADICR.
*/
#define	DMA_ADICR006	(DMA_CH6_ADICR)

/** \brief  20D4, DMA Channel Configuration Register */
#define DMA_CH6_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00120D4u)

/** Alias (User Manual Name) for DMA_CH6_CHCFGR.
* To use register names with standard convension, please use DMA_CH6_CHCFGR.
*/
#define	DMA_CHCFGR006	(DMA_CH6_CHCFGR)

/** \brief  20DC, DMARAM Channel Control and Status Register */
#define DMA_CH6_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00120DCu)

/** Alias (User Manual Name) for DMA_CH6_CHCSR.
* To use register names with standard convension, please use DMA_CH6_CHCSR.
*/
#define	DMA_CHCSR006	(DMA_CH6_CHCSR)

/** \brief  20CC, DMA Channel Destination Address Register x */
#define DMA_CH6_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00120CCu)

/** Alias (User Manual Name) for DMA_CH6_DADR.
* To use register names with standard convension, please use DMA_CH6_DADR.
*/
#define	DMA_DADR006	(DMA_CH6_DADR)

