Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** \brief  2910, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH72_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012910u)

/** Alias (User Manual Name) for DMA_CH72_ADICR.
* To use register names with standard convension, please use DMA_CH72_ADICR.
*/
#define	DMA_ADICR072	(DMA_CH72_ADICR)

/** \brief  2914, DMA Channel Configuration Register */
#define DMA_CH72_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012914u)

/** Alias (User Manual Name) for DMA_CH72_CHCFGR.
* To use register names with standard convension, please use DMA_CH72_CHCFGR.
*/
#define	DMA_CHCFGR072	(DMA_CH72_CHCFGR)

/** \brief  291C, DMARAM Channel Control and Status Register */
#define DMA_CH72_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001291Cu)

/** Alias (User Manual Name) for DMA_CH72_CHCSR.
* To use register names with standard convension, please use DMA_CH72_CHCSR.
*/
#define	DMA_CHCSR072	(DMA_CH72_CHCSR)

/** \brief  290C, DMA Channel Destination Address Register x */
#define DMA_CH72_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001290Cu)

/** Alias (User Manual Name) for DMA_CH72_DADR.
* To use register names with standard convension, please use DMA_CH72_DADR.
*/
#define	DMA_DADR072	(DMA_CH72_DADR)

/** \brief  2900, DMA Channel Read Data CRC Register */
#define DMA_CH72_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012900u)

/** Alias (User Manual Name) for DMA_CH72_RDCRCR.
* To use register names with standard convension, please use DMA_CH72_RDCRCR.
*/
#define	DMA_RDCRCR072	(DMA_CH72_RDCRCR)

/** \brief  2908, DMA Channel Source Address Register */
#define DMA_CH72_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012908u)

/** Alias (User Manual Name) for DMA_CH72_SADR.
* To use register names with standard convension, please use DMA_CH72_SADR.
*/
#define	DMA_SADR072	(DMA_CH72_SADR)

/** \brief  2904, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH72_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012904u)

/** Alias (User Manual Name) for DMA_CH72_SDCRCR.
* To use register names with standard convension, please use DMA_CH72_SDCRCR.
*/
#define	DMA_SDCRCR072	(DMA_CH72_SDCRCR)

/** \brief  2918, DMA Channel Shadow Address Register */
#define DMA_CH72_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012918u)

/** Alias (User Manual Name) for DMA_CH72_SHADR.
* To use register names with standard convension, please use DMA_CH72_SHADR.
*/
#define	DMA_SHADR072	(DMA_CH72_SHADR)

/** \brief  2930, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH73_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012930u)

/** Alias (User Manual Name) for DMA_CH73_ADICR.
* To use register names with standard convension, please use DMA_CH73_ADICR.
*/
#define	DMA_ADICR073	(DMA_CH73_ADICR)

/** \brief  2934, DMA Channel Configuration Register */
#define DMA_CH73_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012934u)

/** Alias (User Manual Name) for DMA_CH73_CHCFGR.
* To use register names with standard convension, please use DMA_CH73_CHCFGR.
*/
#define	DMA_CHCFGR073	(DMA_CH73_CHCFGR)

/** \brief  293C, DMARAM Channel Control and Status Register */
#define DMA_CH73_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001293Cu)

/** Alias (User Manual Name) for DMA_CH73_CHCSR.
* To use register names with standard convension, please use DMA_CH73_CHCSR.
*/
#define	DMA_CHCSR073	(DMA_CH73_CHCSR)

/** \brief  292C, DMA Channel Destination Address Register x */
#define DMA_CH73_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001292Cu)

/** Alias (User Manual Name) for DMA_CH73_DADR.
* To use register names with standard convension, please use DMA_CH73_DADR.
*/
#define	DMA_DADR073	(DMA_CH73_DADR)

/** \brief  2920, DMA Channel Read Data CRC Register */
#define DMA_CH73_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012920u)

/** Alias (User Manual Name) for DMA_CH73_RDCRCR.
* To use register names with standard convension, please use DMA_CH73_RDCRCR.
*/
#define	DMA_RDCRCR073	(DMA_CH73_RDCRCR)

/** \brief  2928, DMA Channel Source Address Register */
#define DMA_CH73_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012928u)

/** Alias (User Manual Name) for DMA_CH73_SADR.
* To use register names with standard convension, please use DMA_CH73_SADR.
*/
#define	DMA_SADR073	(DMA_CH73_SADR)

/** \brief  2924, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH73_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012924u)

/** Alias (User Manual Name) for DMA_CH73_SDCRCR.
* To use register names with standard convension, please use DMA_CH73_SDCRCR.
*/
#define	DMA_SDCRCR073	(DMA_CH73_SDCRCR)

/** \brief  2938, DMA Channel Shadow Address Register */
#define DMA_CH73_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012938u)

/** Alias (User Manual Name) for DMA_CH73_SHADR.
* To use register names with standard convension, please use DMA_CH73_SHADR.
*/
#define	DMA_SHADR073	(DMA_CH73_SHADR)

/** \brief  2950, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH74_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012950u)

/** Alias (User Manual Name) for DMA_CH74_ADICR.
* To use register names with standard convension, please use DMA_CH74_ADICR.
*/
#define	DMA_ADICR074	(DMA_CH74_ADICR)

/** \brief  2954, DMA Channel Configuration Register */
#define DMA_CH74_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012954u)

/** Alias (User Manual Name) for DMA_CH74_CHCFGR.
* To use register names with standard convension, please use DMA_CH74_CHCFGR.
*/
#define	DMA_CHCFGR074	(DMA_CH74_CHCFGR)

/** \brief  295C, DMARAM Channel Control and Status Register */
#define DMA_CH74_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001295Cu)

/** Alias (User Manual Name) for DMA_CH74_CHCSR.
* To use register names with standard convension, please use DMA_CH74_CHCSR.
*/
#define	DMA_CHCSR074	(DMA_CH74_CHCSR)

/** \brief  294C, DMA Channel Destination Address Register x */
#define DMA_CH74_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001294Cu)

