Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH74_DADR.
* To use register names with standard convension, please use DMA_CH74_DADR.
*/
#define	DMA_DADR074	(DMA_CH74_DADR)

/** \brief  2940, DMA Channel Read Data CRC Register */
#define DMA_CH74_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012940u)

/** Alias (User Manual Name) for DMA_CH74_RDCRCR.
* To use register names with standard convension, please use DMA_CH74_RDCRCR.
*/
#define	DMA_RDCRCR074	(DMA_CH74_RDCRCR)

/** \brief  2948, DMA Channel Source Address Register */
#define DMA_CH74_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012948u)

/** Alias (User Manual Name) for DMA_CH74_SADR.
* To use register names with standard convension, please use DMA_CH74_SADR.
*/
#define	DMA_SADR074	(DMA_CH74_SADR)

/** \brief  2944, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH74_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012944u)

/** Alias (User Manual Name) for DMA_CH74_SDCRCR.
* To use register names with standard convension, please use DMA_CH74_SDCRCR.
*/
#define	DMA_SDCRCR074	(DMA_CH74_SDCRCR)

/** \brief  2958, DMA Channel Shadow Address Register */
#define DMA_CH74_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012958u)

/** Alias (User Manual Name) for DMA_CH74_SHADR.
* To use register names with standard convension, please use DMA_CH74_SHADR.
*/
#define	DMA_SHADR074	(DMA_CH74_SHADR)

/** \brief  2970, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH75_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012970u)

/** Alias (User Manual Name) for DMA_CH75_ADICR.
* To use register names with standard convension, please use DMA_CH75_ADICR.
*/
#define	DMA_ADICR075	(DMA_CH75_ADICR)

/** \brief  2974, DMA Channel Configuration Register */
#define DMA_CH75_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012974u)

/** Alias (User Manual Name) for DMA_CH75_CHCFGR.
* To use register names with standard convension, please use DMA_CH75_CHCFGR.
*/
#define	DMA_CHCFGR075	(DMA_CH75_CHCFGR)

/** \brief  297C, DMARAM Channel Control and Status Register */
#define DMA_CH75_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001297Cu)

/** Alias (User Manual Name) for DMA_CH75_CHCSR.
* To use register names with standard convension, please use DMA_CH75_CHCSR.
*/
#define	DMA_CHCSR075	(DMA_CH75_CHCSR)

/** \brief  296C, DMA Channel Destination Address Register x */
#define DMA_CH75_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001296Cu)

/** Alias (User Manual Name) for DMA_CH75_DADR.
* To use register names with standard convension, please use DMA_CH75_DADR.
*/
#define	DMA_DADR075	(DMA_CH75_DADR)

/** \brief  2960, DMA Channel Read Data CRC Register */
#define DMA_CH75_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012960u)

/** Alias (User Manual Name) for DMA_CH75_RDCRCR.
* To use register names with standard convension, please use DMA_CH75_RDCRCR.
*/
#define	DMA_RDCRCR075	(DMA_CH75_RDCRCR)

/** \brief  2968, DMA Channel Source Address Register */
#define DMA_CH75_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012968u)

/** Alias (User Manual Name) for DMA_CH75_SADR.
* To use register names with standard convension, please use DMA_CH75_SADR.
*/
#define	DMA_SADR075	(DMA_CH75_SADR)

/** \brief  2964, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH75_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012964u)

/** Alias (User Manual Name) for DMA_CH75_SDCRCR.
* To use register names with standard convension, please use DMA_CH75_SDCRCR.
*/
#define	DMA_SDCRCR075	(DMA_CH75_SDCRCR)

/** \brief  2978, DMA Channel Shadow Address Register */
#define DMA_CH75_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012978u)

/** Alias (User Manual Name) for DMA_CH75_SHADR.
* To use register names with standard convension, please use DMA_CH75_SHADR.
*/
#define	DMA_SHADR075	(DMA_CH75_SHADR)

/** \brief  2990, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH76_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012990u)

/** Alias (User Manual Name) for DMA_CH76_ADICR.
* To use register names with standard convension, please use DMA_CH76_ADICR.
*/
#define	DMA_ADICR076	(DMA_CH76_ADICR)

/** \brief  2994, DMA Channel Configuration Register */
#define DMA_CH76_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012994u)

/** Alias (User Manual Name) for DMA_CH76_CHCFGR.
* To use register names with standard convension, please use DMA_CH76_CHCFGR.
*/
#define	DMA_CHCFGR076	(DMA_CH76_CHCFGR)

/** \brief  299C, DMARAM Channel Control and Status Register */
#define DMA_CH76_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001299Cu)

/** Alias (User Manual Name) for DMA_CH76_CHCSR.
* To use register names with standard convension, please use DMA_CH76_CHCSR.
*/
#define	DMA_CHCSR076	(DMA_CH76_CHCSR)

/** \brief  298C, DMA Channel Destination Address Register x */
#define DMA_CH76_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001298Cu)

/** Alias (User Manual Name) for DMA_CH76_DADR.
* To use register names with standard convension, please use DMA_CH76_DADR.
*/
#define	DMA_DADR076	(DMA_CH76_DADR)

/** \brief  2980, DMA Channel Read Data CRC Register */
#define DMA_CH76_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012980u)

/** Alias (User Manual Name) for DMA_CH76_RDCRCR.
* To use register names with standard convension, please use DMA_CH76_RDCRCR.
*/
#define	DMA_RDCRCR076	(DMA_CH76_RDCRCR)

/** \brief  2988, DMA Channel Source Address Register */
#define DMA_CH76_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012988u)

/** Alias (User Manual Name) for DMA_CH76_SADR.
* To use register names with standard convension, please use DMA_CH76_SADR.
*/
#define	DMA_SADR076	(DMA_CH76_SADR)

/** \brief  2984, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH76_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012984u)

/** Alias (User Manual Name) for DMA_CH76_SDCRCR.
* To use register names with standard convension, please use DMA_CH76_SDCRCR.
*/
#define	DMA_SDCRCR076	(DMA_CH76_SDCRCR)

/** \brief  2998, DMA Channel Shadow Address Register */
#define DMA_CH76_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012998u)

/** Alias (User Manual Name) for DMA_CH76_SHADR.
* To use register names with standard convension, please use DMA_CH76_SHADR.
*/
#define	DMA_SHADR076	(DMA_CH76_SHADR)

