Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** \brief  29B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH77_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129B0u)

/** Alias (User Manual Name) for DMA_CH77_ADICR.
* To use register names with standard convension, please use DMA_CH77_ADICR.
*/
#define	DMA_ADICR077	(DMA_CH77_ADICR)

/** \brief  29B4, DMA Channel Configuration Register */
#define DMA_CH77_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129B4u)

/** Alias (User Manual Name) for DMA_CH77_CHCFGR.
* To use register names with standard convension, please use DMA_CH77_CHCFGR.
*/
#define	DMA_CHCFGR077	(DMA_CH77_CHCFGR)

/** \brief  29BC, DMARAM Channel Control and Status Register */
#define DMA_CH77_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129BCu)

/** Alias (User Manual Name) for DMA_CH77_CHCSR.
* To use register names with standard convension, please use DMA_CH77_CHCSR.
*/
#define	DMA_CHCSR077	(DMA_CH77_CHCSR)

/** \brief  29AC, DMA Channel Destination Address Register x */
#define DMA_CH77_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129ACu)

/** Alias (User Manual Name) for DMA_CH77_DADR.
* To use register names with standard convension, please use DMA_CH77_DADR.
*/
#define	DMA_DADR077	(DMA_CH77_DADR)

/** \brief  29A0, DMA Channel Read Data CRC Register */
#define DMA_CH77_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129A0u)

/** Alias (User Manual Name) for DMA_CH77_RDCRCR.
* To use register names with standard convension, please use DMA_CH77_RDCRCR.
*/
#define	DMA_RDCRCR077	(DMA_CH77_RDCRCR)

/** \brief  29A8, DMA Channel Source Address Register */
#define DMA_CH77_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129A8u)

/** Alias (User Manual Name) for DMA_CH77_SADR.
* To use register names with standard convension, please use DMA_CH77_SADR.
*/
#define	DMA_SADR077	(DMA_CH77_SADR)

/** \brief  29A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH77_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129A4u)

/** Alias (User Manual Name) for DMA_CH77_SDCRCR.
* To use register names with standard convension, please use DMA_CH77_SDCRCR.
*/
#define	DMA_SDCRCR077	(DMA_CH77_SDCRCR)

/** \brief  29B8, DMA Channel Shadow Address Register */
#define DMA_CH77_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129B8u)

/** Alias (User Manual Name) for DMA_CH77_SHADR.
* To use register names with standard convension, please use DMA_CH77_SHADR.
*/
#define	DMA_SHADR077	(DMA_CH77_SHADR)

/** \brief  29D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH78_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129D0u)

/** Alias (User Manual Name) for DMA_CH78_ADICR.
* To use register names with standard convension, please use DMA_CH78_ADICR.
*/
#define	DMA_ADICR078	(DMA_CH78_ADICR)

/** \brief  29D4, DMA Channel Configuration Register */
#define DMA_CH78_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129D4u)

/** Alias (User Manual Name) for DMA_CH78_CHCFGR.
* To use register names with standard convension, please use DMA_CH78_CHCFGR.
*/
#define	DMA_CHCFGR078	(DMA_CH78_CHCFGR)

/** \brief  29DC, DMARAM Channel Control and Status Register */
#define DMA_CH78_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129DCu)

/** Alias (User Manual Name) for DMA_CH78_CHCSR.
* To use register names with standard convension, please use DMA_CH78_CHCSR.
*/
#define	DMA_CHCSR078	(DMA_CH78_CHCSR)

/** \brief  29CC, DMA Channel Destination Address Register x */
#define DMA_CH78_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129CCu)

/** Alias (User Manual Name) for DMA_CH78_DADR.
* To use register names with standard convension, please use DMA_CH78_DADR.
*/
#define	DMA_DADR078	(DMA_CH78_DADR)

/** \brief  29C0, DMA Channel Read Data CRC Register */
#define DMA_CH78_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129C0u)

/** Alias (User Manual Name) for DMA_CH78_RDCRCR.
* To use register names with standard convension, please use DMA_CH78_RDCRCR.
*/
#define	DMA_RDCRCR078	(DMA_CH78_RDCRCR)

/** \brief  29C8, DMA Channel Source Address Register */
#define DMA_CH78_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129C8u)

/** Alias (User Manual Name) for DMA_CH78_SADR.
* To use register names with standard convension, please use DMA_CH78_SADR.
*/
#define	DMA_SADR078	(DMA_CH78_SADR)

/** \brief  29C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH78_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129C4u)

/** Alias (User Manual Name) for DMA_CH78_SDCRCR.
* To use register names with standard convension, please use DMA_CH78_SDCRCR.
*/
#define	DMA_SDCRCR078	(DMA_CH78_SDCRCR)

/** \brief  29D8, DMA Channel Shadow Address Register */
#define DMA_CH78_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129D8u)

/** Alias (User Manual Name) for DMA_CH78_SHADR.
* To use register names with standard convension, please use DMA_CH78_SHADR.
*/
#define	DMA_SHADR078	(DMA_CH78_SHADR)

/** \brief  29F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH79_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129F0u)

/** Alias (User Manual Name) for DMA_CH79_ADICR.
* To use register names with standard convension, please use DMA_CH79_ADICR.
*/
#define	DMA_ADICR079	(DMA_CH79_ADICR)

/** \brief  29F4, DMA Channel Configuration Register */
#define DMA_CH79_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129F4u)

/** Alias (User Manual Name) for DMA_CH79_CHCFGR.
* To use register names with standard convension, please use DMA_CH79_CHCFGR.
*/
#define	DMA_CHCFGR079	(DMA_CH79_CHCFGR)

/** \brief  29FC, DMARAM Channel Control and Status Register */
#define DMA_CH79_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129FCu)

/** Alias (User Manual Name) for DMA_CH79_CHCSR.
* To use register names with standard convension, please use DMA_CH79_CHCSR.
*/
#define	DMA_CHCSR079	(DMA_CH79_CHCSR)

/** \brief  29EC, DMA Channel Destination Address Register x */
#define DMA_CH79_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129ECu)

