Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH79_DADR.
* To use register names with standard convension, please use DMA_CH79_DADR.
*/
#define	DMA_DADR079	(DMA_CH79_DADR)

/** \brief  29E0, DMA Channel Read Data CRC Register */
#define DMA_CH79_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129E0u)

/** Alias (User Manual Name) for DMA_CH79_RDCRCR.
* To use register names with standard convension, please use DMA_CH79_RDCRCR.
*/
#define	DMA_RDCRCR079	(DMA_CH79_RDCRCR)

/** \brief  29E8, DMA Channel Source Address Register */
#define DMA_CH79_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129E8u)

/** Alias (User Manual Name) for DMA_CH79_SADR.
* To use register names with standard convension, please use DMA_CH79_SADR.
*/
#define	DMA_SADR079	(DMA_CH79_SADR)

/** \brief  29E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH79_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129E4u)

/** Alias (User Manual Name) for DMA_CH79_SDCRCR.
* To use register names with standard convension, please use DMA_CH79_SDCRCR.
*/
#define	DMA_SDCRCR079	(DMA_CH79_SDCRCR)

/** \brief  29F8, DMA Channel Shadow Address Register */
#define DMA_CH79_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129F8u)

/** Alias (User Manual Name) for DMA_CH79_SHADR.
* To use register names with standard convension, please use DMA_CH79_SHADR.
*/
#define	DMA_SHADR079	(DMA_CH79_SHADR)

/** \brief  20F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH7_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00120F0u)

/** Alias (User Manual Name) for DMA_CH7_ADICR.
* To use register names with standard convension, please use DMA_CH7_ADICR.
*/
#define	DMA_ADICR007	(DMA_CH7_ADICR)

/** \brief  20F4, DMA Channel Configuration Register */
#define DMA_CH7_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00120F4u)

/** Alias (User Manual Name) for DMA_CH7_CHCFGR.
* To use register names with standard convension, please use DMA_CH7_CHCFGR.
*/
#define	DMA_CHCFGR007	(DMA_CH7_CHCFGR)

/** \brief  20FC, DMARAM Channel Control and Status Register */
#define DMA_CH7_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00120FCu)

/** Alias (User Manual Name) for DMA_CH7_CHCSR.
* To use register names with standard convension, please use DMA_CH7_CHCSR.
*/
#define	DMA_CHCSR007	(DMA_CH7_CHCSR)

/** \brief  20EC, DMA Channel Destination Address Register x */
#define DMA_CH7_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00120ECu)

/** Alias (User Manual Name) for DMA_CH7_DADR.
* To use register names with standard convension, please use DMA_CH7_DADR.
*/
#define	DMA_DADR007	(DMA_CH7_DADR)

/** \brief  20E0, DMA Channel Read Data CRC Register */
#define DMA_CH7_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00120E0u)

/** Alias (User Manual Name) for DMA_CH7_RDCRCR.
* To use register names with standard convension, please use DMA_CH7_RDCRCR.
*/
#define	DMA_RDCRCR007	(DMA_CH7_RDCRCR)

/** \brief  20E8, DMA Channel Source Address Register */
#define DMA_CH7_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00120E8u)

/** Alias (User Manual Name) for DMA_CH7_SADR.
* To use register names with standard convension, please use DMA_CH7_SADR.
*/
#define	DMA_SADR007	(DMA_CH7_SADR)

/** \brief  20E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH7_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00120E4u)

/** Alias (User Manual Name) for DMA_CH7_SDCRCR.
* To use register names with standard convension, please use DMA_CH7_SDCRCR.
*/
#define	DMA_SDCRCR007	(DMA_CH7_SDCRCR)

/** \brief  20F8, DMA Channel Shadow Address Register */
#define DMA_CH7_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00120F8u)

/** Alias (User Manual Name) for DMA_CH7_SHADR.
* To use register names with standard convension, please use DMA_CH7_SHADR.
*/
#define	DMA_SHADR007	(DMA_CH7_SHADR)

/** \brief  2A10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH80_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A10u)

/** Alias (User Manual Name) for DMA_CH80_ADICR.
* To use register names with standard convension, please use DMA_CH80_ADICR.
*/
#define	DMA_ADICR080	(DMA_CH80_ADICR)

/** \brief  2A14, DMA Channel Configuration Register */
#define DMA_CH80_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A14u)

/** Alias (User Manual Name) for DMA_CH80_CHCFGR.
* To use register names with standard convension, please use DMA_CH80_CHCFGR.
*/
#define	DMA_CHCFGR080	(DMA_CH80_CHCFGR)

/** \brief  2A1C, DMARAM Channel Control and Status Register */
#define DMA_CH80_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A1Cu)

/** Alias (User Manual Name) for DMA_CH80_CHCSR.
* To use register names with standard convension, please use DMA_CH80_CHCSR.
*/
#define	DMA_CHCSR080	(DMA_CH80_CHCSR)

/** \brief  2A0C, DMA Channel Destination Address Register x */
#define DMA_CH80_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A0Cu)

/** Alias (User Manual Name) for DMA_CH80_DADR.
* To use register names with standard convension, please use DMA_CH80_DADR.
*/
#define	DMA_DADR080	(DMA_CH80_DADR)

/** \brief  2A00, DMA Channel Read Data CRC Register */
#define DMA_CH80_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A00u)

/** Alias (User Manual Name) for DMA_CH80_RDCRCR.
* To use register names with standard convension, please use DMA_CH80_RDCRCR.
*/
#define	DMA_RDCRCR080	(DMA_CH80_RDCRCR)

/** \brief  2A08, DMA Channel Source Address Register */
#define DMA_CH80_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A08u)

/** Alias (User Manual Name) for DMA_CH80_SADR.
* To use register names with standard convension, please use DMA_CH80_SADR.
*/
#define	DMA_SADR080	(DMA_CH80_SADR)

/** \brief  2A04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH80_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A04u)

/** Alias (User Manual Name) for DMA_CH80_SDCRCR.
* To use register names with standard convension, please use DMA_CH80_SDCRCR.
*/
#define	DMA_SDCRCR080	(DMA_CH80_SDCRCR)

/** \brief  2A18, DMA Channel Shadow Address Register */
#define DMA_CH80_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A18u)

