Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH80_SHADR.
* To use register names with standard convension, please use DMA_CH80_SHADR.
*/
#define	DMA_SHADR080	(DMA_CH80_SHADR)

/** \brief  2A30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH81_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A30u)

/** Alias (User Manual Name) for DMA_CH81_ADICR.
* To use register names with standard convension, please use DMA_CH81_ADICR.
*/
#define	DMA_ADICR081	(DMA_CH81_ADICR)

/** \brief  2A34, DMA Channel Configuration Register */
#define DMA_CH81_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A34u)

/** Alias (User Manual Name) for DMA_CH81_CHCFGR.
* To use register names with standard convension, please use DMA_CH81_CHCFGR.
*/
#define	DMA_CHCFGR081	(DMA_CH81_CHCFGR)

/** \brief  2A3C, DMARAM Channel Control and Status Register */
#define DMA_CH81_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A3Cu)

/** Alias (User Manual Name) for DMA_CH81_CHCSR.
* To use register names with standard convension, please use DMA_CH81_CHCSR.
*/
#define	DMA_CHCSR081	(DMA_CH81_CHCSR)

/** \brief  2A2C, DMA Channel Destination Address Register x */
#define DMA_CH81_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A2Cu)

/** Alias (User Manual Name) for DMA_CH81_DADR.
* To use register names with standard convension, please use DMA_CH81_DADR.
*/
#define	DMA_DADR081	(DMA_CH81_DADR)

/** \brief  2A20, DMA Channel Read Data CRC Register */
#define DMA_CH81_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A20u)

/** Alias (User Manual Name) for DMA_CH81_RDCRCR.
* To use register names with standard convension, please use DMA_CH81_RDCRCR.
*/
#define	DMA_RDCRCR081	(DMA_CH81_RDCRCR)

/** \brief  2A28, DMA Channel Source Address Register */
#define DMA_CH81_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A28u)

/** Alias (User Manual Name) for DMA_CH81_SADR.
* To use register names with standard convension, please use DMA_CH81_SADR.
*/
#define	DMA_SADR081	(DMA_CH81_SADR)

/** \brief  2A24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH81_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A24u)

/** Alias (User Manual Name) for DMA_CH81_SDCRCR.
* To use register names with standard convension, please use DMA_CH81_SDCRCR.
*/
#define	DMA_SDCRCR081	(DMA_CH81_SDCRCR)

/** \brief  2A38, DMA Channel Shadow Address Register */
#define DMA_CH81_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A38u)

/** Alias (User Manual Name) for DMA_CH81_SHADR.
* To use register names with standard convension, please use DMA_CH81_SHADR.
*/
#define	DMA_SHADR081	(DMA_CH81_SHADR)

/** \brief  2A50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH82_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A50u)

/** Alias (User Manual Name) for DMA_CH82_ADICR.
* To use register names with standard convension, please use DMA_CH82_ADICR.
*/
#define	DMA_ADICR082	(DMA_CH82_ADICR)

/** \brief  2A54, DMA Channel Configuration Register */
#define DMA_CH82_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A54u)

/** Alias (User Manual Name) for DMA_CH82_CHCFGR.
* To use register names with standard convension, please use DMA_CH82_CHCFGR.
*/
#define	DMA_CHCFGR082	(DMA_CH82_CHCFGR)

/** \brief  2A5C, DMARAM Channel Control and Status Register */
#define DMA_CH82_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A5Cu)

/** Alias (User Manual Name) for DMA_CH82_CHCSR.
* To use register names with standard convension, please use DMA_CH82_CHCSR.
*/
#define	DMA_CHCSR082	(DMA_CH82_CHCSR)

/** \brief  2A4C, DMA Channel Destination Address Register x */
#define DMA_CH82_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A4Cu)

/** Alias (User Manual Name) for DMA_CH82_DADR.
* To use register names with standard convension, please use DMA_CH82_DADR.
*/
#define	DMA_DADR082	(DMA_CH82_DADR)

/** \brief  2A40, DMA Channel Read Data CRC Register */
#define DMA_CH82_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A40u)

/** Alias (User Manual Name) for DMA_CH82_RDCRCR.
* To use register names with standard convension, please use DMA_CH82_RDCRCR.
*/
#define	DMA_RDCRCR082	(DMA_CH82_RDCRCR)

/** \brief  2A48, DMA Channel Source Address Register */
#define DMA_CH82_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A48u)

/** Alias (User Manual Name) for DMA_CH82_SADR.
* To use register names with standard convension, please use DMA_CH82_SADR.
*/
#define	DMA_SADR082	(DMA_CH82_SADR)

/** \brief  2A44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH82_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A44u)

/** Alias (User Manual Name) for DMA_CH82_SDCRCR.
* To use register names with standard convension, please use DMA_CH82_SDCRCR.
*/
#define	DMA_SDCRCR082	(DMA_CH82_SDCRCR)

/** \brief  2A58, DMA Channel Shadow Address Register */
#define DMA_CH82_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A58u)

/** Alias (User Manual Name) for DMA_CH82_SHADR.
* To use register names with standard convension, please use DMA_CH82_SHADR.
*/
#define	DMA_SHADR082	(DMA_CH82_SHADR)

/** \brief  2A70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH83_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A70u)

/** Alias (User Manual Name) for DMA_CH83_ADICR.
* To use register names with standard convension, please use DMA_CH83_ADICR.
*/
#define	DMA_ADICR083	(DMA_CH83_ADICR)

/** \brief  2A74, DMA Channel Configuration Register */
#define DMA_CH83_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A74u)

/** Alias (User Manual Name) for DMA_CH83_CHCFGR.
* To use register names with standard convension, please use DMA_CH83_CHCFGR.
*/
#define	DMA_CHCFGR083	(DMA_CH83_CHCFGR)

/** \brief  2A7C, DMARAM Channel Control and Status Register */
#define DMA_CH83_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A7Cu)

/** Alias (User Manual Name) for DMA_CH83_CHCSR.
* To use register names with standard convension, please use DMA_CH83_CHCSR.
*/
#define	DMA_CHCSR083	(DMA_CH83_CHCSR)

/** \brief  2A6C, DMA Channel Destination Address Register x */
#define DMA_CH83_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A6Cu)

/** Alias (User Manual Name) for DMA_CH83_DADR.
* To use register names with standard convension, please use DMA_CH83_DADR.
*/
#define	DMA_DADR083	(DMA_CH83_DADR)

/** \brief  2A60, DMA Channel Read Data CRC Register */
#define DMA_CH83_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A60u)

