Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH83_RDCRCR.
* To use register names with standard convension, please use DMA_CH83_RDCRCR.
*/
#define	DMA_RDCRCR083	(DMA_CH83_RDCRCR)

/** \brief  2A68, DMA Channel Source Address Register */
#define DMA_CH83_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A68u)

/** Alias (User Manual Name) for DMA_CH83_SADR.
* To use register names with standard convension, please use DMA_CH83_SADR.
*/
#define	DMA_SADR083	(DMA_CH83_SADR)

/** \brief  2A64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH83_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A64u)

/** Alias (User Manual Name) for DMA_CH83_SDCRCR.
* To use register names with standard convension, please use DMA_CH83_SDCRCR.
*/
#define	DMA_SDCRCR083	(DMA_CH83_SDCRCR)

/** \brief  2A78, DMA Channel Shadow Address Register */
#define DMA_CH83_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A78u)

/** Alias (User Manual Name) for DMA_CH83_SHADR.
* To use register names with standard convension, please use DMA_CH83_SHADR.
*/
#define	DMA_SHADR083	(DMA_CH83_SHADR)

/** \brief  2A90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH84_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A90u)

/** Alias (User Manual Name) for DMA_CH84_ADICR.
* To use register names with standard convension, please use DMA_CH84_ADICR.
*/
#define	DMA_ADICR084	(DMA_CH84_ADICR)

/** \brief  2A94, DMA Channel Configuration Register */
#define DMA_CH84_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A94u)

/** Alias (User Manual Name) for DMA_CH84_CHCFGR.
* To use register names with standard convension, please use DMA_CH84_CHCFGR.
*/
#define	DMA_CHCFGR084	(DMA_CH84_CHCFGR)

/** \brief  2A9C, DMARAM Channel Control and Status Register */
#define DMA_CH84_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A9Cu)

/** Alias (User Manual Name) for DMA_CH84_CHCSR.
* To use register names with standard convension, please use DMA_CH84_CHCSR.
*/
#define	DMA_CHCSR084	(DMA_CH84_CHCSR)

/** \brief  2A8C, DMA Channel Destination Address Register x */
#define DMA_CH84_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A8Cu)

/** Alias (User Manual Name) for DMA_CH84_DADR.
* To use register names with standard convension, please use DMA_CH84_DADR.
*/
#define	DMA_DADR084	(DMA_CH84_DADR)

/** \brief  2A80, DMA Channel Read Data CRC Register */
#define DMA_CH84_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A80u)

/** Alias (User Manual Name) for DMA_CH84_RDCRCR.
* To use register names with standard convension, please use DMA_CH84_RDCRCR.
*/
#define	DMA_RDCRCR084	(DMA_CH84_RDCRCR)

/** \brief  2A88, DMA Channel Source Address Register */
#define DMA_CH84_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A88u)

/** Alias (User Manual Name) for DMA_CH84_SADR.
* To use register names with standard convension, please use DMA_CH84_SADR.
*/
#define	DMA_SADR084	(DMA_CH84_SADR)

/** \brief  2A84, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH84_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A84u)

/** Alias (User Manual Name) for DMA_CH84_SDCRCR.
* To use register names with standard convension, please use DMA_CH84_SDCRCR.
*/
#define	DMA_SDCRCR084	(DMA_CH84_SDCRCR)

/** \brief  2A98, DMA Channel Shadow Address Register */
#define DMA_CH84_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A98u)

/** Alias (User Manual Name) for DMA_CH84_SHADR.
* To use register names with standard convension, please use DMA_CH84_SHADR.
*/
#define	DMA_SHADR084	(DMA_CH84_SHADR)

/** \brief  2AB0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH85_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012AB0u)

/** Alias (User Manual Name) for DMA_CH85_ADICR.
* To use register names with standard convension, please use DMA_CH85_ADICR.
*/
#define	DMA_ADICR085	(DMA_CH85_ADICR)

/** \brief  2AB4, DMA Channel Configuration Register */
#define DMA_CH85_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012AB4u)

/** Alias (User Manual Name) for DMA_CH85_CHCFGR.
* To use register names with standard convension, please use DMA_CH85_CHCFGR.
*/
#define	DMA_CHCFGR085	(DMA_CH85_CHCFGR)

/** \brief  2ABC, DMARAM Channel Control and Status Register */
#define DMA_CH85_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012ABCu)

/** Alias (User Manual Name) for DMA_CH85_CHCSR.
* To use register names with standard convension, please use DMA_CH85_CHCSR.
*/
#define	DMA_CHCSR085	(DMA_CH85_CHCSR)

/** \brief  2AAC, DMA Channel Destination Address Register x */
#define DMA_CH85_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012AACu)

/** Alias (User Manual Name) for DMA_CH85_DADR.
* To use register names with standard convension, please use DMA_CH85_DADR.
*/
#define	DMA_DADR085	(DMA_CH85_DADR)

/** \brief  2AA0, DMA Channel Read Data CRC Register */
#define DMA_CH85_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012AA0u)

/** Alias (User Manual Name) for DMA_CH85_RDCRCR.
* To use register names with standard convension, please use DMA_CH85_RDCRCR.
*/
#define	DMA_RDCRCR085	(DMA_CH85_RDCRCR)

/** \brief  2AA8, DMA Channel Source Address Register */
#define DMA_CH85_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012AA8u)

/** Alias (User Manual Name) for DMA_CH85_SADR.
* To use register names with standard convension, please use DMA_CH85_SADR.
*/
#define	DMA_SADR085	(DMA_CH85_SADR)

/** \brief  2AA4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH85_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012AA4u)

/** Alias (User Manual Name) for DMA_CH85_SDCRCR.
* To use register names with standard convension, please use DMA_CH85_SDCRCR.
*/
#define	DMA_SDCRCR085	(DMA_CH85_SDCRCR)

/** \brief  2AB8, DMA Channel Shadow Address Register */
#define DMA_CH85_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012AB8u)

