Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH85_SHADR.
* To use register names with standard convension, please use DMA_CH85_SHADR.
*/
#define	DMA_SHADR085	(DMA_CH85_SHADR)

/** \brief  2AD0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH86_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012AD0u)

/** Alias (User Manual Name) for DMA_CH86_ADICR.
* To use register names with standard convension, please use DMA_CH86_ADICR.
*/
#define	DMA_ADICR086	(DMA_CH86_ADICR)

/** \brief  2AD4, DMA Channel Configuration Register */
#define DMA_CH86_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012AD4u)

/** Alias (User Manual Name) for DMA_CH86_CHCFGR.
* To use register names with standard convension, please use DMA_CH86_CHCFGR.
*/
#define	DMA_CHCFGR086	(DMA_CH86_CHCFGR)

/** \brief  2ADC, DMARAM Channel Control and Status Register */
#define DMA_CH86_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012ADCu)

/** Alias (User Manual Name) for DMA_CH86_CHCSR.
* To use register names with standard convension, please use DMA_CH86_CHCSR.
*/
#define	DMA_CHCSR086	(DMA_CH86_CHCSR)

/** \brief  2ACC, DMA Channel Destination Address Register x */
#define DMA_CH86_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012ACCu)

/** Alias (User Manual Name) for DMA_CH86_DADR.
* To use register names with standard convension, please use DMA_CH86_DADR.
*/
#define	DMA_DADR086	(DMA_CH86_DADR)

/** \brief  2AC0, DMA Channel Read Data CRC Register */
#define DMA_CH86_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012AC0u)

/** Alias (User Manual Name) for DMA_CH86_RDCRCR.
* To use register names with standard convension, please use DMA_CH86_RDCRCR.
*/
#define	DMA_RDCRCR086	(DMA_CH86_RDCRCR)

/** \brief  2AC8, DMA Channel Source Address Register */
#define DMA_CH86_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012AC8u)

/** Alias (User Manual Name) for DMA_CH86_SADR.
* To use register names with standard convension, please use DMA_CH86_SADR.
*/
#define	DMA_SADR086	(DMA_CH86_SADR)

/** \brief  2AC4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH86_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012AC4u)

/** Alias (User Manual Name) for DMA_CH86_SDCRCR.
* To use register names with standard convension, please use DMA_CH86_SDCRCR.
*/
#define	DMA_SDCRCR086	(DMA_CH86_SDCRCR)

/** \brief  2AD8, DMA Channel Shadow Address Register */
#define DMA_CH86_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012AD8u)

/** Alias (User Manual Name) for DMA_CH86_SHADR.
* To use register names with standard convension, please use DMA_CH86_SHADR.
*/
#define	DMA_SHADR086	(DMA_CH86_SHADR)

/** \brief  2AF0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH87_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012AF0u)

/** Alias (User Manual Name) for DMA_CH87_ADICR.
* To use register names with standard convension, please use DMA_CH87_ADICR.
*/
#define	DMA_ADICR087	(DMA_CH87_ADICR)

/** \brief  2AF4, DMA Channel Configuration Register */
#define DMA_CH87_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012AF4u)

/** Alias (User Manual Name) for DMA_CH87_CHCFGR.
* To use register names with standard convension, please use DMA_CH87_CHCFGR.
*/
#define	DMA_CHCFGR087	(DMA_CH87_CHCFGR)

/** \brief  2AFC, DMARAM Channel Control and Status Register */
#define DMA_CH87_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012AFCu)

/** Alias (User Manual Name) for DMA_CH87_CHCSR.
* To use register names with standard convension, please use DMA_CH87_CHCSR.
*/
#define	DMA_CHCSR087	(DMA_CH87_CHCSR)

/** \brief  2AEC, DMA Channel Destination Address Register x */
#define DMA_CH87_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012AECu)

/** Alias (User Manual Name) for DMA_CH87_DADR.
* To use register names with standard convension, please use DMA_CH87_DADR.
*/
#define	DMA_DADR087	(DMA_CH87_DADR)

/** \brief  2AE0, DMA Channel Read Data CRC Register */
#define DMA_CH87_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012AE0u)

/** Alias (User Manual Name) for DMA_CH87_RDCRCR.
* To use register names with standard convension, please use DMA_CH87_RDCRCR.
*/
#define	DMA_RDCRCR087	(DMA_CH87_RDCRCR)

/** \brief  2AE8, DMA Channel Source Address Register */
#define DMA_CH87_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012AE8u)

/** Alias (User Manual Name) for DMA_CH87_SADR.
* To use register names with standard convension, please use DMA_CH87_SADR.
*/
#define	DMA_SADR087	(DMA_CH87_SADR)

/** \brief  2AE4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH87_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012AE4u)

/** Alias (User Manual Name) for DMA_CH87_SDCRCR.
* To use register names with standard convension, please use DMA_CH87_SDCRCR.
*/
#define	DMA_SDCRCR087	(DMA_CH87_SDCRCR)

/** \brief  2AF8, DMA Channel Shadow Address Register */
#define DMA_CH87_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012AF8u)

/** Alias (User Manual Name) for DMA_CH87_SHADR.
* To use register names with standard convension, please use DMA_CH87_SHADR.
*/
#define	DMA_SHADR087	(DMA_CH87_SHADR)

/** \brief  2B10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH88_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B10u)

/** Alias (User Manual Name) for DMA_CH88_ADICR.
* To use register names with standard convension, please use DMA_CH88_ADICR.
*/
#define	DMA_ADICR088	(DMA_CH88_ADICR)

/** \brief  2B14, DMA Channel Configuration Register */
#define DMA_CH88_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B14u)

/** Alias (User Manual Name) for DMA_CH88_CHCFGR.
* To use register names with standard convension, please use DMA_CH88_CHCFGR.
*/
#define	DMA_CHCFGR088	(DMA_CH88_CHCFGR)

/** \brief  2B1C, DMARAM Channel Control and Status Register */
#define DMA_CH88_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B1Cu)

