Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH88_CHCSR.
* To use register names with standard convension, please use DMA_CH88_CHCSR.
*/
#define	DMA_CHCSR088	(DMA_CH88_CHCSR)

/** \brief  2B0C, DMA Channel Destination Address Register x */
#define DMA_CH88_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B0Cu)

/** Alias (User Manual Name) for DMA_CH88_DADR.
* To use register names with standard convension, please use DMA_CH88_DADR.
*/
#define	DMA_DADR088	(DMA_CH88_DADR)

/** \brief  2B00, DMA Channel Read Data CRC Register */
#define DMA_CH88_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B00u)

/** Alias (User Manual Name) for DMA_CH88_RDCRCR.
* To use register names with standard convension, please use DMA_CH88_RDCRCR.
*/
#define	DMA_RDCRCR088	(DMA_CH88_RDCRCR)

/** \brief  2B08, DMA Channel Source Address Register */
#define DMA_CH88_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B08u)

/** Alias (User Manual Name) for DMA_CH88_SADR.
* To use register names with standard convension, please use DMA_CH88_SADR.
*/
#define	DMA_SADR088	(DMA_CH88_SADR)

/** \brief  2B04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH88_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B04u)

/** Alias (User Manual Name) for DMA_CH88_SDCRCR.
* To use register names with standard convension, please use DMA_CH88_SDCRCR.
*/
#define	DMA_SDCRCR088	(DMA_CH88_SDCRCR)

/** \brief  2B18, DMA Channel Shadow Address Register */
#define DMA_CH88_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B18u)

/** Alias (User Manual Name) for DMA_CH88_SHADR.
* To use register names with standard convension, please use DMA_CH88_SHADR.
*/
#define	DMA_SHADR088	(DMA_CH88_SHADR)

/** \brief  2B30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH89_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B30u)

/** Alias (User Manual Name) for DMA_CH89_ADICR.
* To use register names with standard convension, please use DMA_CH89_ADICR.
*/
#define	DMA_ADICR089	(DMA_CH89_ADICR)

/** \brief  2B34, DMA Channel Configuration Register */
#define DMA_CH89_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B34u)

/** Alias (User Manual Name) for DMA_CH89_CHCFGR.
* To use register names with standard convension, please use DMA_CH89_CHCFGR.
*/
#define	DMA_CHCFGR089	(DMA_CH89_CHCFGR)

/** \brief  2B3C, DMARAM Channel Control and Status Register */
#define DMA_CH89_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B3Cu)

/** Alias (User Manual Name) for DMA_CH89_CHCSR.
* To use register names with standard convension, please use DMA_CH89_CHCSR.
*/
#define	DMA_CHCSR089	(DMA_CH89_CHCSR)

/** \brief  2B2C, DMA Channel Destination Address Register x */
#define DMA_CH89_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B2Cu)

/** Alias (User Manual Name) for DMA_CH89_DADR.
* To use register names with standard convension, please use DMA_CH89_DADR.
*/
#define	DMA_DADR089	(DMA_CH89_DADR)

/** \brief  2B20, DMA Channel Read Data CRC Register */
#define DMA_CH89_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B20u)

/** Alias (User Manual Name) for DMA_CH89_RDCRCR.
* To use register names with standard convension, please use DMA_CH89_RDCRCR.
*/
#define	DMA_RDCRCR089	(DMA_CH89_RDCRCR)

/** \brief  2B28, DMA Channel Source Address Register */
#define DMA_CH89_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B28u)

/** Alias (User Manual Name) for DMA_CH89_SADR.
* To use register names with standard convension, please use DMA_CH89_SADR.
*/
#define	DMA_SADR089	(DMA_CH89_SADR)

/** \brief  2B24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH89_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B24u)

/** Alias (User Manual Name) for DMA_CH89_SDCRCR.
* To use register names with standard convension, please use DMA_CH89_SDCRCR.
*/
#define	DMA_SDCRCR089	(DMA_CH89_SDCRCR)

/** \brief  2B38, DMA Channel Shadow Address Register */
#define DMA_CH89_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B38u)

/** Alias (User Manual Name) for DMA_CH89_SHADR.
* To use register names with standard convension, please use DMA_CH89_SHADR.
*/
#define	DMA_SHADR089	(DMA_CH89_SHADR)

/** \brief  2110, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH8_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012110u)

/** Alias (User Manual Name) for DMA_CH8_ADICR.
* To use register names with standard convension, please use DMA_CH8_ADICR.
*/
#define	DMA_ADICR008	(DMA_CH8_ADICR)

/** \brief  2114, DMA Channel Configuration Register */
#define DMA_CH8_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012114u)

/** Alias (User Manual Name) for DMA_CH8_CHCFGR.
* To use register names with standard convension, please use DMA_CH8_CHCFGR.
*/
#define	DMA_CHCFGR008	(DMA_CH8_CHCFGR)

/** \brief  211C, DMARAM Channel Control and Status Register */
#define DMA_CH8_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001211Cu)

/** Alias (User Manual Name) for DMA_CH8_CHCSR.
* To use register names with standard convension, please use DMA_CH8_CHCSR.
*/
#define	DMA_CHCSR008	(DMA_CH8_CHCSR)

/** \brief  210C, DMA Channel Destination Address Register x */
#define DMA_CH8_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001210Cu)

/** Alias (User Manual Name) for DMA_CH8_DADR.
* To use register names with standard convension, please use DMA_CH8_DADR.
*/
#define	DMA_DADR008	(DMA_CH8_DADR)

/** \brief  2100, DMA Channel Read Data CRC Register */
#define DMA_CH8_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012100u)

/** Alias (User Manual Name) for DMA_CH8_RDCRCR.
* To use register names with standard convension, please use DMA_CH8_RDCRCR.
*/
#define	DMA_RDCRCR008	(DMA_CH8_RDCRCR)

/** \brief  2108, DMA Channel Source Address Register */
#define DMA_CH8_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012108u)

/** Alias (User Manual Name) for DMA_CH8_SADR.
* To use register names with standard convension, please use DMA_CH8_SADR.
*/
#define	DMA_SADR008	(DMA_CH8_SADR)

/** \brief  2104, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH8_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012104u)

/** Alias (User Manual Name) for DMA_CH8_SDCRCR.
* To use register names with standard convension, please use DMA_CH8_SDCRCR.
*/
#define	DMA_SDCRCR008	(DMA_CH8_SDCRCR)

/** \brief  2118, DMA Channel Shadow Address Register */
#define DMA_CH8_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012118u)

/** Alias (User Manual Name) for DMA_CH8_SHADR.
* To use register names with standard convension, please use DMA_CH8_SHADR.
*/
#define	DMA_SHADR008	(DMA_CH8_SHADR)

/** \brief  2B50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH90_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B50u)

