Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH90_ADICR.
* To use register names with standard convension, please use DMA_CH90_ADICR.
*/
#define	DMA_ADICR090	(DMA_CH90_ADICR)

/** \brief  2B54, DMA Channel Configuration Register */
#define DMA_CH90_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B54u)

/** Alias (User Manual Name) for DMA_CH90_CHCFGR.
* To use register names with standard convension, please use DMA_CH90_CHCFGR.
*/
#define	DMA_CHCFGR090	(DMA_CH90_CHCFGR)

/** \brief  2B5C, DMARAM Channel Control and Status Register */
#define DMA_CH90_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B5Cu)

/** Alias (User Manual Name) for DMA_CH90_CHCSR.
* To use register names with standard convension, please use DMA_CH90_CHCSR.
*/
#define	DMA_CHCSR090	(DMA_CH90_CHCSR)

/** \brief  2B4C, DMA Channel Destination Address Register x */
#define DMA_CH90_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B4Cu)

/** Alias (User Manual Name) for DMA_CH90_DADR.
* To use register names with standard convension, please use DMA_CH90_DADR.
*/
#define	DMA_DADR090	(DMA_CH90_DADR)

/** \brief  2B40, DMA Channel Read Data CRC Register */
#define DMA_CH90_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B40u)

/** Alias (User Manual Name) for DMA_CH90_RDCRCR.
* To use register names with standard convension, please use DMA_CH90_RDCRCR.
*/
#define	DMA_RDCRCR090	(DMA_CH90_RDCRCR)

/** \brief  2B48, DMA Channel Source Address Register */
#define DMA_CH90_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B48u)

/** Alias (User Manual Name) for DMA_CH90_SADR.
* To use register names with standard convension, please use DMA_CH90_SADR.
*/
#define	DMA_SADR090	(DMA_CH90_SADR)

/** \brief  2B44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH90_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B44u)

/** Alias (User Manual Name) for DMA_CH90_SDCRCR.
* To use register names with standard convension, please use DMA_CH90_SDCRCR.
*/
#define	DMA_SDCRCR090	(DMA_CH90_SDCRCR)

/** \brief  2B58, DMA Channel Shadow Address Register */
#define DMA_CH90_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B58u)

/** Alias (User Manual Name) for DMA_CH90_SHADR.
* To use register names with standard convension, please use DMA_CH90_SHADR.
*/
#define	DMA_SHADR090	(DMA_CH90_SHADR)

/** \brief  2B70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH91_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B70u)

/** Alias (User Manual Name) for DMA_CH91_ADICR.
* To use register names with standard convension, please use DMA_CH91_ADICR.
*/
#define	DMA_ADICR091	(DMA_CH91_ADICR)

/** \brief  2B74, DMA Channel Configuration Register */
#define DMA_CH91_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B74u)

/** Alias (User Manual Name) for DMA_CH91_CHCFGR.
* To use register names with standard convension, please use DMA_CH91_CHCFGR.
*/
#define	DMA_CHCFGR091	(DMA_CH91_CHCFGR)

/** \brief  2B7C, DMARAM Channel Control and Status Register */
#define DMA_CH91_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B7Cu)

/** Alias (User Manual Name) for DMA_CH91_CHCSR.
* To use register names with standard convension, please use DMA_CH91_CHCSR.
*/
#define	DMA_CHCSR091	(DMA_CH91_CHCSR)

/** \brief  2B6C, DMA Channel Destination Address Register x */
#define DMA_CH91_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B6Cu)

/** Alias (User Manual Name) for DMA_CH91_DADR.
* To use register names with standard convension, please use DMA_CH91_DADR.
*/
#define	DMA_DADR091	(DMA_CH91_DADR)

/** \brief  2B60, DMA Channel Read Data CRC Register */
#define DMA_CH91_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B60u)

/** Alias (User Manual Name) for DMA_CH91_RDCRCR.
* To use register names with standard convension, please use DMA_CH91_RDCRCR.
*/
#define	DMA_RDCRCR091	(DMA_CH91_RDCRCR)

/** \brief  2B68, DMA Channel Source Address Register */
#define DMA_CH91_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B68u)

/** Alias (User Manual Name) for DMA_CH91_SADR.
* To use register names with standard convension, please use DMA_CH91_SADR.
*/
#define	DMA_SADR091	(DMA_CH91_SADR)

/** \brief  2B64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH91_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B64u)

/** Alias (User Manual Name) for DMA_CH91_SDCRCR.
* To use register names with standard convension, please use DMA_CH91_SDCRCR.
*/
#define	DMA_SDCRCR091	(DMA_CH91_SDCRCR)

/** \brief  2B78, DMA Channel Shadow Address Register */
#define DMA_CH91_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B78u)

/** Alias (User Manual Name) for DMA_CH91_SHADR.
* To use register names with standard convension, please use DMA_CH91_SHADR.
*/
#define	DMA_SHADR091	(DMA_CH91_SHADR)

/** \brief  2B90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH92_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B90u)

/** Alias (User Manual Name) for DMA_CH92_ADICR.
* To use register names with standard convension, please use DMA_CH92_ADICR.
*/
#define	DMA_ADICR092	(DMA_CH92_ADICR)

/** \brief  2B94, DMA Channel Configuration Register */
#define DMA_CH92_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B94u)

/** Alias (User Manual Name) for DMA_CH92_CHCFGR.
* To use register names with standard convension, please use DMA_CH92_CHCFGR.
*/
#define	DMA_CHCFGR092	(DMA_CH92_CHCFGR)

/** \brief  2B9C, DMARAM Channel Control and Status Register */
#define DMA_CH92_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B9Cu)

/** Alias (User Manual Name) for DMA_CH92_CHCSR.
* To use register names with standard convension, please use DMA_CH92_CHCSR.
*/
#define	DMA_CHCSR092	(DMA_CH92_CHCSR)

/** \brief  2B8C, DMA Channel Destination Address Register x */
#define DMA_CH92_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B8Cu)

