Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** \brief  2C40, DMA Channel Read Data CRC Register */
#define DMA_CH98_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C40u)

/** Alias (User Manual Name) for DMA_CH98_RDCRCR.
* To use register names with standard convension, please use DMA_CH98_RDCRCR.
*/
#define	DMA_RDCRCR098	(DMA_CH98_RDCRCR)

/** \brief  2C48, DMA Channel Source Address Register */
#define DMA_CH98_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C48u)

/** Alias (User Manual Name) for DMA_CH98_SADR.
* To use register names with standard convension, please use DMA_CH98_SADR.
*/
#define	DMA_SADR098	(DMA_CH98_SADR)

/** \brief  2C44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH98_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C44u)

/** Alias (User Manual Name) for DMA_CH98_SDCRCR.
* To use register names with standard convension, please use DMA_CH98_SDCRCR.
*/
#define	DMA_SDCRCR098	(DMA_CH98_SDCRCR)

/** \brief  2C58, DMA Channel Shadow Address Register */
#define DMA_CH98_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C58u)

/** Alias (User Manual Name) for DMA_CH98_SHADR.
* To use register names with standard convension, please use DMA_CH98_SHADR.
*/
#define	DMA_SHADR098	(DMA_CH98_SHADR)

/** \brief  2C70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH99_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C70u)

/** Alias (User Manual Name) for DMA_CH99_ADICR.
* To use register names with standard convension, please use DMA_CH99_ADICR.
*/
#define	DMA_ADICR099	(DMA_CH99_ADICR)

/** \brief  2C74, DMA Channel Configuration Register */
#define DMA_CH99_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C74u)

/** Alias (User Manual Name) for DMA_CH99_CHCFGR.
* To use register names with standard convension, please use DMA_CH99_CHCFGR.
*/
#define	DMA_CHCFGR099	(DMA_CH99_CHCFGR)

/** \brief  2C7C, DMARAM Channel Control and Status Register */
#define DMA_CH99_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C7Cu)

/** Alias (User Manual Name) for DMA_CH99_CHCSR.
* To use register names with standard convension, please use DMA_CH99_CHCSR.
*/
#define	DMA_CHCSR099	(DMA_CH99_CHCSR)

/** \brief  2C6C, DMA Channel Destination Address Register x */
#define DMA_CH99_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C6Cu)

/** Alias (User Manual Name) for DMA_CH99_DADR.
* To use register names with standard convension, please use DMA_CH99_DADR.
*/
#define	DMA_DADR099	(DMA_CH99_DADR)

/** \brief  2C60, DMA Channel Read Data CRC Register */
#define DMA_CH99_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C60u)

/** Alias (User Manual Name) for DMA_CH99_RDCRCR.
* To use register names with standard convension, please use DMA_CH99_RDCRCR.
*/
#define	DMA_RDCRCR099	(DMA_CH99_RDCRCR)

/** \brief  2C68, DMA Channel Source Address Register */
#define DMA_CH99_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C68u)

/** Alias (User Manual Name) for DMA_CH99_SADR.
* To use register names with standard convension, please use DMA_CH99_SADR.
*/
#define	DMA_SADR099	(DMA_CH99_SADR)

/** \brief  2C64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH99_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C64u)

/** Alias (User Manual Name) for DMA_CH99_SDCRCR.
* To use register names with standard convension, please use DMA_CH99_SDCRCR.
*/
#define	DMA_SDCRCR099	(DMA_CH99_SDCRCR)

/** \brief  2C78, DMA Channel Shadow Address Register */
#define DMA_CH99_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C78u)

/** Alias (User Manual Name) for DMA_CH99_SHADR.
* To use register names with standard convension, please use DMA_CH99_SHADR.
*/
#define	DMA_SHADR099	(DMA_CH99_SHADR)

/** \brief  2130, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH9_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012130u)

/** Alias (User Manual Name) for DMA_CH9_ADICR.
* To use register names with standard convension, please use DMA_CH9_ADICR.
*/
#define	DMA_ADICR009	(DMA_CH9_ADICR)

/** \brief  2134, DMA Channel Configuration Register */
#define DMA_CH9_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012134u)

/** Alias (User Manual Name) for DMA_CH9_CHCFGR.
* To use register names with standard convension, please use DMA_CH9_CHCFGR.
*/
#define	DMA_CHCFGR009	(DMA_CH9_CHCFGR)

/** \brief  213C, DMARAM Channel Control and Status Register */
#define DMA_CH9_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001213Cu)

/** Alias (User Manual Name) for DMA_CH9_CHCSR.
* To use register names with standard convension, please use DMA_CH9_CHCSR.
*/
#define	DMA_CHCSR009	(DMA_CH9_CHCSR)

/** \brief  212C, DMA Channel Destination Address Register x */
#define DMA_CH9_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001212Cu)

/** Alias (User Manual Name) for DMA_CH9_DADR.
* To use register names with standard convension, please use DMA_CH9_DADR.
*/
#define	DMA_DADR009	(DMA_CH9_DADR)

/** \brief  2120, DMA Channel Read Data CRC Register */
#define DMA_CH9_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012120u)

/** Alias (User Manual Name) for DMA_CH9_RDCRCR.
* To use register names with standard convension, please use DMA_CH9_RDCRCR.
*/
#define	DMA_RDCRCR009	(DMA_CH9_RDCRCR)

/** \brief  2128, DMA Channel Source Address Register */
#define DMA_CH9_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012128u)

/** Alias (User Manual Name) for DMA_CH9_SADR.
* To use register names with standard convension, please use DMA_CH9_SADR.
*/
#define	DMA_SADR009	(DMA_CH9_SADR)

/** \brief  2124, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH9_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012124u)

/** Alias (User Manual Name) for DMA_CH9_SDCRCR.
* To use register names with standard convension, please use DMA_CH9_SDCRCR.
*/
#define	DMA_SDCRCR009	(DMA_CH9_SDCRCR)

/** \brief  2138, DMA Channel Shadow Address Register */
#define DMA_CH9_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012138u)

/** Alias (User Manual Name) for DMA_CH9_SHADR.
* To use register names with standard convension, please use DMA_CH9_SHADR.
*/
#define	DMA_SHADR009	(DMA_CH9_SHADR)

/** \brief  0, DMA Clock Control Register */
#define DMA_CLC /*lint --e(923)*/ (*(volatile Ifx_DMA_CLC*)0xF0010000u)

