Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** \brief  1204, DMA Error Interrupt Set Register */
#define DMA_ERRINTR /*lint --e(923)*/ (*(volatile Ifx_DMA_ERRINTR*)0xF0011204u)

/** \brief  1800, DMA Channel Hardware Resource Register */
#define DMA_HRR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011800u)

/** Alias (User Manual Name) for DMA_HRR0.
* To use register names with standard convension, please use DMA_HRR0.
*/
#define	DMA_HRR000	(DMA_HRR0)

/** \brief  1804, DMA Channel Hardware Resource Register */
#define DMA_HRR1 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011804u)

/** Alias (User Manual Name) for DMA_HRR1.
* To use register names with standard convension, please use DMA_HRR1.
*/
#define	DMA_HRR001	(DMA_HRR1)

/** \brief  1828, DMA Channel Hardware Resource Register */
#define DMA_HRR10 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011828u)

/** Alias (User Manual Name) for DMA_HRR10.
* To use register names with standard convension, please use DMA_HRR10.
*/
#define	DMA_HRR010	(DMA_HRR10)

/** \brief  1990, DMA Channel Hardware Resource Register */
#define DMA_HRR100 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011990u)

/** \brief  1994, DMA Channel Hardware Resource Register */
#define DMA_HRR101 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011994u)

/** \brief  1998, DMA Channel Hardware Resource Register */
#define DMA_HRR102 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011998u)

/** \brief  199C, DMA Channel Hardware Resource Register */
#define DMA_HRR103 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001199Cu)

/** \brief  19A0, DMA Channel Hardware Resource Register */
#define DMA_HRR104 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119A0u)

/** \brief  19A4, DMA Channel Hardware Resource Register */
#define DMA_HRR105 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119A4u)

/** \brief  19A8, DMA Channel Hardware Resource Register */
#define DMA_HRR106 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119A8u)

/** \brief  19AC, DMA Channel Hardware Resource Register */
#define DMA_HRR107 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119ACu)

/** \brief  19B0, DMA Channel Hardware Resource Register */
#define DMA_HRR108 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119B0u)

/** \brief  19B4, DMA Channel Hardware Resource Register */
#define DMA_HRR109 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119B4u)

/** \brief  182C, DMA Channel Hardware Resource Register */
#define DMA_HRR11 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001182Cu)

/** Alias (User Manual Name) for DMA_HRR11.
* To use register names with standard convension, please use DMA_HRR11.
*/
#define	DMA_HRR011	(DMA_HRR11)

/** \brief  19B8, DMA Channel Hardware Resource Register */
#define DMA_HRR110 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119B8u)

/** \brief  19BC, DMA Channel Hardware Resource Register */
#define DMA_HRR111 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119BCu)

/** \brief  19C0, DMA Channel Hardware Resource Register */
#define DMA_HRR112 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119C0u)

/** \brief  19C4, DMA Channel Hardware Resource Register */
#define DMA_HRR113 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119C4u)

/** \brief  19C8, DMA Channel Hardware Resource Register */
#define DMA_HRR114 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119C8u)

/** \brief  19CC, DMA Channel Hardware Resource Register */
#define DMA_HRR115 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119CCu)

/** \brief  19D0, DMA Channel Hardware Resource Register */
#define DMA_HRR116 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119D0u)

/** \brief  19D4, DMA Channel Hardware Resource Register */
#define DMA_HRR117 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119D4u)

/** \brief  19D8, DMA Channel Hardware Resource Register */
#define DMA_HRR118 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119D8u)

/** \brief  19DC, DMA Channel Hardware Resource Register */
#define DMA_HRR119 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119DCu)

/** \brief  1830, DMA Channel Hardware Resource Register */
#define DMA_HRR12 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011830u)

/** Alias (User Manual Name) for DMA_HRR12.
* To use register names with standard convension, please use DMA_HRR12.
*/
#define	DMA_HRR012	(DMA_HRR12)

/** \brief  19E0, DMA Channel Hardware Resource Register */
#define DMA_HRR120 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119E0u)

/** \brief  19E4, DMA Channel Hardware Resource Register */
#define DMA_HRR121 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119E4u)

/** \brief  19E8, DMA Channel Hardware Resource Register */
#define DMA_HRR122 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119E8u)

/** \brief  19EC, DMA Channel Hardware Resource Register */
#define DMA_HRR123 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119ECu)

/** \brief  19F0, DMA Channel Hardware Resource Register */
#define DMA_HRR124 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119F0u)

/** \brief  19F4, DMA Channel Hardware Resource Register */
#define DMA_HRR125 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119F4u)

/** \brief  19F8, DMA Channel Hardware Resource Register */
#define DMA_HRR126 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119F8u)

/** \brief  19FC, DMA Channel Hardware Resource Register */
#define DMA_HRR127 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00119FCu)

/** \brief  1834, DMA Channel Hardware Resource Register */
#define DMA_HRR13 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011834u)

/** Alias (User Manual Name) for DMA_HRR13.
* To use register names with standard convension, please use DMA_HRR13.
*/
#define	DMA_HRR013	(DMA_HRR13)

/** \brief  1838, DMA Channel Hardware Resource Register */
#define DMA_HRR14 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011838u)

/** Alias (User Manual Name) for DMA_HRR14.
* To use register names with standard convension, please use DMA_HRR14.
*/
#define	DMA_HRR014	(DMA_HRR14)

/** \brief  183C, DMA Channel Hardware Resource Register */
#define DMA_HRR15 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001183Cu)

/** Alias (User Manual Name) for DMA_HRR15.
* To use register names with standard convension, please use DMA_HRR15.
*/
#define	DMA_HRR015	(DMA_HRR15)

