Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_HRR57.
* To use register names with standard convension, please use DMA_HRR57.
*/
#define	DMA_HRR057	(DMA_HRR57)

/** \brief  18E8, DMA Channel Hardware Resource Register */
#define DMA_HRR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118E8u)

/** Alias (User Manual Name) for DMA_HRR58.
* To use register names with standard convension, please use DMA_HRR58.
*/
#define	DMA_HRR058	(DMA_HRR58)

/** \brief  18EC, DMA Channel Hardware Resource Register */
#define DMA_HRR59 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118ECu)

/** Alias (User Manual Name) for DMA_HRR59.
* To use register names with standard convension, please use DMA_HRR59.
*/
#define	DMA_HRR059	(DMA_HRR59)

/** \brief  1818, DMA Channel Hardware Resource Register */
#define DMA_HRR6 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011818u)

/** Alias (User Manual Name) for DMA_HRR6.
* To use register names with standard convension, please use DMA_HRR6.
*/
#define	DMA_HRR006	(DMA_HRR6)

/** \brief  18F0, DMA Channel Hardware Resource Register */
#define DMA_HRR60 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118F0u)

/** Alias (User Manual Name) for DMA_HRR60.
* To use register names with standard convension, please use DMA_HRR60.
*/
#define	DMA_HRR060	(DMA_HRR60)

/** \brief  18F4, DMA Channel Hardware Resource Register */
#define DMA_HRR61 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118F4u)

/** Alias (User Manual Name) for DMA_HRR61.
* To use register names with standard convension, please use DMA_HRR61.
*/
#define	DMA_HRR061	(DMA_HRR61)

/** \brief  18F8, DMA Channel Hardware Resource Register */
#define DMA_HRR62 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118F8u)

/** Alias (User Manual Name) for DMA_HRR62.
* To use register names with standard convension, please use DMA_HRR62.
*/
#define	DMA_HRR062	(DMA_HRR62)

/** \brief  18FC, DMA Channel Hardware Resource Register */
#define DMA_HRR63 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118FCu)

/** Alias (User Manual Name) for DMA_HRR63.
* To use register names with standard convension, please use DMA_HRR63.
*/
#define	DMA_HRR063	(DMA_HRR63)

/** \brief  1900, DMA Channel Hardware Resource Register */
#define DMA_HRR64 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011900u)

/** Alias (User Manual Name) for DMA_HRR64.
* To use register names with standard convension, please use DMA_HRR64.
*/
#define	DMA_HRR064	(DMA_HRR64)

/** \brief  1904, DMA Channel Hardware Resource Register */
#define DMA_HRR65 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011904u)

/** Alias (User Manual Name) for DMA_HRR65.
* To use register names with standard convension, please use DMA_HRR65.
*/
#define	DMA_HRR065	(DMA_HRR65)

/** \brief  1908, DMA Channel Hardware Resource Register */
#define DMA_HRR66 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011908u)

/** Alias (User Manual Name) for DMA_HRR66.
* To use register names with standard convension, please use DMA_HRR66.
*/
#define	DMA_HRR066	(DMA_HRR66)

/** \brief  190C, DMA Channel Hardware Resource Register */
#define DMA_HRR67 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001190Cu)

/** Alias (User Manual Name) for DMA_HRR67.
* To use register names with standard convension, please use DMA_HRR67.
*/
#define	DMA_HRR067	(DMA_HRR67)

/** \brief  1910, DMA Channel Hardware Resource Register */
#define DMA_HRR68 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011910u)

/** Alias (User Manual Name) for DMA_HRR68.
* To use register names with standard convension, please use DMA_HRR68.
*/
#define	DMA_HRR068	(DMA_HRR68)

/** \brief  1914, DMA Channel Hardware Resource Register */
#define DMA_HRR69 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011914u)

/** Alias (User Manual Name) for DMA_HRR69.
* To use register names with standard convension, please use DMA_HRR69.
*/
#define	DMA_HRR069	(DMA_HRR69)

/** \brief  181C, DMA Channel Hardware Resource Register */
#define DMA_HRR7 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001181Cu)

/** Alias (User Manual Name) for DMA_HRR7.
* To use register names with standard convension, please use DMA_HRR7.
*/
#define	DMA_HRR007	(DMA_HRR7)

/** \brief  1918, DMA Channel Hardware Resource Register */
#define DMA_HRR70 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011918u)

/** Alias (User Manual Name) for DMA_HRR70.
* To use register names with standard convension, please use DMA_HRR70.
*/
#define	DMA_HRR070	(DMA_HRR70)

/** \brief  191C, DMA Channel Hardware Resource Register */
#define DMA_HRR71 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001191Cu)

/** Alias (User Manual Name) for DMA_HRR71.
* To use register names with standard convension, please use DMA_HRR71.
*/
#define	DMA_HRR071	(DMA_HRR71)

/** \brief  1920, DMA Channel Hardware Resource Register */
#define DMA_HRR72 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011920u)

/** Alias (User Manual Name) for DMA_HRR72.
* To use register names with standard convension, please use DMA_HRR72.
*/
#define	DMA_HRR072	(DMA_HRR72)

/** \brief  1924, DMA Channel Hardware Resource Register */
#define DMA_HRR73 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011924u)

/** Alias (User Manual Name) for DMA_HRR73.
* To use register names with standard convension, please use DMA_HRR73.
*/
#define	DMA_HRR073	(DMA_HRR73)

/** \brief  1928, DMA Channel Hardware Resource Register */
#define DMA_HRR74 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011928u)

/** Alias (User Manual Name) for DMA_HRR74.
* To use register names with standard convension, please use DMA_HRR74.
*/
#define	DMA_HRR074	(DMA_HRR74)

/** \brief  192C, DMA Channel Hardware Resource Register */
#define DMA_HRR75 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001192Cu)

/** Alias (User Manual Name) for DMA_HRR75.
* To use register names with standard convension, please use DMA_HRR75.
*/
#define	DMA_HRR075	(DMA_HRR75)

/** \brief  1930, DMA Channel Hardware Resource Register */
#define DMA_HRR76 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011930u)

/** Alias (User Manual Name) for DMA_HRR76.
* To use register names with standard convension, please use DMA_HRR76.
*/
#define	DMA_HRR076	(DMA_HRR76)

/** \brief  1934, DMA Channel Hardware Resource Register */
#define DMA_HRR77 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011934u)

/** Alias (User Manual Name) for DMA_HRR77.
* To use register names with standard convension, please use DMA_HRR77.
*/
#define	DMA_HRR077	(DMA_HRR77)

