Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSACR72.
* To use register names with standard convension, please use DMA_SUSACR72.
*/
#define	DMA_SUSACR072	(DMA_SUSACR72)

/** \brief  1D24, DMA Suspend Acknowledge Register */
#define DMA_SUSACR73 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D24u)

/** Alias (User Manual Name) for DMA_SUSACR73.
* To use register names with standard convension, please use DMA_SUSACR73.
*/
#define	DMA_SUSACR073	(DMA_SUSACR73)

/** \brief  1D28, DMA Suspend Acknowledge Register */
#define DMA_SUSACR74 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D28u)

/** Alias (User Manual Name) for DMA_SUSACR74.
* To use register names with standard convension, please use DMA_SUSACR74.
*/
#define	DMA_SUSACR074	(DMA_SUSACR74)

/** \brief  1D2C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR75 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D2Cu)

/** Alias (User Manual Name) for DMA_SUSACR75.
* To use register names with standard convension, please use DMA_SUSACR75.
*/
#define	DMA_SUSACR075	(DMA_SUSACR75)

/** \brief  1D30, DMA Suspend Acknowledge Register */
#define DMA_SUSACR76 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D30u)

/** Alias (User Manual Name) for DMA_SUSACR76.
* To use register names with standard convension, please use DMA_SUSACR76.
*/
#define	DMA_SUSACR076	(DMA_SUSACR76)

/** \brief  1D34, DMA Suspend Acknowledge Register */
#define DMA_SUSACR77 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D34u)

/** Alias (User Manual Name) for DMA_SUSACR77.
* To use register names with standard convension, please use DMA_SUSACR77.
*/
#define	DMA_SUSACR077	(DMA_SUSACR77)

/** \brief  1D38, DMA Suspend Acknowledge Register */
#define DMA_SUSACR78 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D38u)

/** Alias (User Manual Name) for DMA_SUSACR78.
* To use register names with standard convension, please use DMA_SUSACR78.
*/
#define	DMA_SUSACR078	(DMA_SUSACR78)

/** \brief  1D3C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR79 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D3Cu)

/** Alias (User Manual Name) for DMA_SUSACR79.
* To use register names with standard convension, please use DMA_SUSACR79.
*/
#define	DMA_SUSACR079	(DMA_SUSACR79)

/** \brief  1C20, DMA Suspend Acknowledge Register */
#define DMA_SUSACR8 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C20u)

/** Alias (User Manual Name) for DMA_SUSACR8.
* To use register names with standard convension, please use DMA_SUSACR8.
*/
#define	DMA_SUSACR008	(DMA_SUSACR8)

/** \brief  1D40, DMA Suspend Acknowledge Register */
#define DMA_SUSACR80 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D40u)

/** Alias (User Manual Name) for DMA_SUSACR80.
* To use register names with standard convension, please use DMA_SUSACR80.
*/
#define	DMA_SUSACR080	(DMA_SUSACR80)

/** \brief  1D44, DMA Suspend Acknowledge Register */
#define DMA_SUSACR81 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D44u)

/** Alias (User Manual Name) for DMA_SUSACR81.
* To use register names with standard convension, please use DMA_SUSACR81.
*/
#define	DMA_SUSACR081	(DMA_SUSACR81)

/** \brief  1D48, DMA Suspend Acknowledge Register */
#define DMA_SUSACR82 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D48u)

/** Alias (User Manual Name) for DMA_SUSACR82.
* To use register names with standard convension, please use DMA_SUSACR82.
*/
#define	DMA_SUSACR082	(DMA_SUSACR82)

/** \brief  1D4C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR83 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D4Cu)

/** Alias (User Manual Name) for DMA_SUSACR83.
* To use register names with standard convension, please use DMA_SUSACR83.
*/
#define	DMA_SUSACR083	(DMA_SUSACR83)

/** \brief  1D50, DMA Suspend Acknowledge Register */
#define DMA_SUSACR84 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D50u)

/** Alias (User Manual Name) for DMA_SUSACR84.
* To use register names with standard convension, please use DMA_SUSACR84.
*/
#define	DMA_SUSACR084	(DMA_SUSACR84)

/** \brief  1D54, DMA Suspend Acknowledge Register */
#define DMA_SUSACR85 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D54u)

/** Alias (User Manual Name) for DMA_SUSACR85.
* To use register names with standard convension, please use DMA_SUSACR85.
*/
#define	DMA_SUSACR085	(DMA_SUSACR85)

/** \brief  1D58, DMA Suspend Acknowledge Register */
#define DMA_SUSACR86 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D58u)

/** Alias (User Manual Name) for DMA_SUSACR86.
* To use register names with standard convension, please use DMA_SUSACR86.
*/
#define	DMA_SUSACR086	(DMA_SUSACR86)

/** \brief  1D5C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR87 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D5Cu)

/** Alias (User Manual Name) for DMA_SUSACR87.
* To use register names with standard convension, please use DMA_SUSACR87.
*/
#define	DMA_SUSACR087	(DMA_SUSACR87)

/** \brief  1D60, DMA Suspend Acknowledge Register */
#define DMA_SUSACR88 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D60u)

/** Alias (User Manual Name) for DMA_SUSACR88.
* To use register names with standard convension, please use DMA_SUSACR88.
*/
#define	DMA_SUSACR088	(DMA_SUSACR88)

/** \brief  1D64, DMA Suspend Acknowledge Register */
#define DMA_SUSACR89 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D64u)

/** Alias (User Manual Name) for DMA_SUSACR89.
* To use register names with standard convension, please use DMA_SUSACR89.
*/
#define	DMA_SUSACR089	(DMA_SUSACR89)

/** \brief  1C24, DMA Suspend Acknowledge Register */
#define DMA_SUSACR9 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C24u)

/** Alias (User Manual Name) for DMA_SUSACR9.
* To use register names with standard convension, please use DMA_SUSACR9.
*/
#define	DMA_SUSACR009	(DMA_SUSACR9)

/** \brief  1D68, DMA Suspend Acknowledge Register */
#define DMA_SUSACR90 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D68u)

/** Alias (User Manual Name) for DMA_SUSACR90.
* To use register names with standard convension, please use DMA_SUSACR90.
*/
#define	DMA_SUSACR090	(DMA_SUSACR90)

/** \brief  1D6C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR91 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D6Cu)

/** Alias (User Manual Name) for DMA_SUSACR91.
* To use register names with standard convension, please use DMA_SUSACR91.
*/
#define	DMA_SUSACR091	(DMA_SUSACR91)

