Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** \brief  1A78, DMA Suspend Enable Register */
#define DMA_SUSENR30 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A78u)

/** Alias (User Manual Name) for DMA_SUSENR30.
* To use register names with standard convension, please use DMA_SUSENR30.
*/
#define	DMA_SUSENR030	(DMA_SUSENR30)

/** \brief  1A7C, DMA Suspend Enable Register */
#define DMA_SUSENR31 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A7Cu)

/** Alias (User Manual Name) for DMA_SUSENR31.
* To use register names with standard convension, please use DMA_SUSENR31.
*/
#define	DMA_SUSENR031	(DMA_SUSENR31)

/** \brief  1A80, DMA Suspend Enable Register */
#define DMA_SUSENR32 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A80u)

/** Alias (User Manual Name) for DMA_SUSENR32.
* To use register names with standard convension, please use DMA_SUSENR32.
*/
#define	DMA_SUSENR032	(DMA_SUSENR32)

/** \brief  1A84, DMA Suspend Enable Register */
#define DMA_SUSENR33 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A84u)

/** Alias (User Manual Name) for DMA_SUSENR33.
* To use register names with standard convension, please use DMA_SUSENR33.
*/
#define	DMA_SUSENR033	(DMA_SUSENR33)

/** \brief  1A88, DMA Suspend Enable Register */
#define DMA_SUSENR34 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A88u)

/** Alias (User Manual Name) for DMA_SUSENR34.
* To use register names with standard convension, please use DMA_SUSENR34.
*/
#define	DMA_SUSENR034	(DMA_SUSENR34)

/** \brief  1A8C, DMA Suspend Enable Register */
#define DMA_SUSENR35 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A8Cu)

/** Alias (User Manual Name) for DMA_SUSENR35.
* To use register names with standard convension, please use DMA_SUSENR35.
*/
#define	DMA_SUSENR035	(DMA_SUSENR35)

/** \brief  1A90, DMA Suspend Enable Register */
#define DMA_SUSENR36 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A90u)

/** Alias (User Manual Name) for DMA_SUSENR36.
* To use register names with standard convension, please use DMA_SUSENR36.
*/
#define	DMA_SUSENR036	(DMA_SUSENR36)

/** \brief  1A94, DMA Suspend Enable Register */
#define DMA_SUSENR37 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A94u)

/** Alias (User Manual Name) for DMA_SUSENR37.
* To use register names with standard convension, please use DMA_SUSENR37.
*/
#define	DMA_SUSENR037	(DMA_SUSENR37)

/** \brief  1A98, DMA Suspend Enable Register */
#define DMA_SUSENR38 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A98u)

/** Alias (User Manual Name) for DMA_SUSENR38.
* To use register names with standard convension, please use DMA_SUSENR38.
*/
#define	DMA_SUSENR038	(DMA_SUSENR38)

/** \brief  1A9C, DMA Suspend Enable Register */
#define DMA_SUSENR39 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A9Cu)

/** Alias (User Manual Name) for DMA_SUSENR39.
* To use register names with standard convension, please use DMA_SUSENR39.
*/
#define	DMA_SUSENR039	(DMA_SUSENR39)

/** \brief  1A10, DMA Suspend Enable Register */
#define DMA_SUSENR4 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A10u)

/** Alias (User Manual Name) for DMA_SUSENR4.
* To use register names with standard convension, please use DMA_SUSENR4.
*/
#define	DMA_SUSENR004	(DMA_SUSENR4)

/** \brief  1AA0, DMA Suspend Enable Register */
#define DMA_SUSENR40 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AA0u)

/** Alias (User Manual Name) for DMA_SUSENR40.
* To use register names with standard convension, please use DMA_SUSENR40.
*/
#define	DMA_SUSENR040	(DMA_SUSENR40)

/** \brief  1AA4, DMA Suspend Enable Register */
#define DMA_SUSENR41 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AA4u)

/** Alias (User Manual Name) for DMA_SUSENR41.
* To use register names with standard convension, please use DMA_SUSENR41.
*/
#define	DMA_SUSENR041	(DMA_SUSENR41)

/** \brief  1AA8, DMA Suspend Enable Register */
#define DMA_SUSENR42 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AA8u)

/** Alias (User Manual Name) for DMA_SUSENR42.
* To use register names with standard convension, please use DMA_SUSENR42.
*/
#define	DMA_SUSENR042	(DMA_SUSENR42)

/** \brief  1AAC, DMA Suspend Enable Register */
#define DMA_SUSENR43 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AACu)

/** Alias (User Manual Name) for DMA_SUSENR43.
* To use register names with standard convension, please use DMA_SUSENR43.
*/
#define	DMA_SUSENR043	(DMA_SUSENR43)

/** \brief  1AB0, DMA Suspend Enable Register */
#define DMA_SUSENR44 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AB0u)

/** Alias (User Manual Name) for DMA_SUSENR44.
* To use register names with standard convension, please use DMA_SUSENR44.
*/
#define	DMA_SUSENR044	(DMA_SUSENR44)

/** \brief  1AB4, DMA Suspend Enable Register */
#define DMA_SUSENR45 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AB4u)

/** Alias (User Manual Name) for DMA_SUSENR45.
* To use register names with standard convension, please use DMA_SUSENR45.
*/
#define	DMA_SUSENR045	(DMA_SUSENR45)

/** \brief  1AB8, DMA Suspend Enable Register */
#define DMA_SUSENR46 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AB8u)

/** Alias (User Manual Name) for DMA_SUSENR46.
* To use register names with standard convension, please use DMA_SUSENR46.
*/
#define	DMA_SUSENR046	(DMA_SUSENR46)

/** \brief  1ABC, DMA Suspend Enable Register */
#define DMA_SUSENR47 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011ABCu)

/** Alias (User Manual Name) for DMA_SUSENR47.
* To use register names with standard convension, please use DMA_SUSENR47.
*/
#define	DMA_SUSENR047	(DMA_SUSENR47)

/** \brief  1AC0, DMA Suspend Enable Register */
#define DMA_SUSENR48 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AC0u)

/** Alias (User Manual Name) for DMA_SUSENR48.
* To use register names with standard convension, please use DMA_SUSENR48.
*/
#define	DMA_SUSENR048	(DMA_SUSENR48)

/** \brief  1AC4, DMA Suspend Enable Register */
#define DMA_SUSENR49 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AC4u)

/** Alias (User Manual Name) for DMA_SUSENR49.
* To use register names with standard convension, please use DMA_SUSENR49.
*/
#define	DMA_SUSENR049	(DMA_SUSENR49)

/** \brief  1A14, DMA Suspend Enable Register */
#define DMA_SUSENR5 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A14u)

