Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_TSR48.
* To use register names with standard convension, please use DMA_TSR48.
*/
#define	DMA_TSR048	(DMA_TSR48)

/** \brief  1EC4, DMA Transaction State Register */
#define DMA_TSR49 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC4u)

/** Alias (User Manual Name) for DMA_TSR49.
* To use register names with standard convension, please use DMA_TSR49.
*/
#define	DMA_TSR049	(DMA_TSR49)

/** \brief  1E14, DMA Transaction State Register */
#define DMA_TSR5 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E14u)

/** Alias (User Manual Name) for DMA_TSR5.
* To use register names with standard convension, please use DMA_TSR5.
*/
#define	DMA_TSR005	(DMA_TSR5)

/** \brief  1EC8, DMA Transaction State Register */
#define DMA_TSR50 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC8u)

/** Alias (User Manual Name) for DMA_TSR50.
* To use register names with standard convension, please use DMA_TSR50.
*/
#define	DMA_TSR050	(DMA_TSR50)

/** \brief  1ECC, DMA Transaction State Register */
#define DMA_TSR51 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ECCu)

/** Alias (User Manual Name) for DMA_TSR51.
* To use register names with standard convension, please use DMA_TSR51.
*/
#define	DMA_TSR051	(DMA_TSR51)

/** \brief  1ED0, DMA Transaction State Register */
#define DMA_TSR52 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED0u)

/** Alias (User Manual Name) for DMA_TSR52.
* To use register names with standard convension, please use DMA_TSR52.
*/
#define	DMA_TSR052	(DMA_TSR52)

/** \brief  1ED4, DMA Transaction State Register */
#define DMA_TSR53 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED4u)

/** Alias (User Manual Name) for DMA_TSR53.
* To use register names with standard convension, please use DMA_TSR53.
*/
#define	DMA_TSR053	(DMA_TSR53)

/** \brief  1ED8, DMA Transaction State Register */
#define DMA_TSR54 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED8u)

/** Alias (User Manual Name) for DMA_TSR54.
* To use register names with standard convension, please use DMA_TSR54.
*/
#define	DMA_TSR054	(DMA_TSR54)

/** \brief  1EDC, DMA Transaction State Register */
#define DMA_TSR55 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EDCu)

/** Alias (User Manual Name) for DMA_TSR55.
* To use register names with standard convension, please use DMA_TSR55.
*/
#define	DMA_TSR055	(DMA_TSR55)

/** \brief  1EE0, DMA Transaction State Register */
#define DMA_TSR56 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE0u)

/** Alias (User Manual Name) for DMA_TSR56.
* To use register names with standard convension, please use DMA_TSR56.
*/
#define	DMA_TSR056	(DMA_TSR56)

/** \brief  1EE4, DMA Transaction State Register */
#define DMA_TSR57 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE4u)

/** Alias (User Manual Name) for DMA_TSR57.
* To use register names with standard convension, please use DMA_TSR57.
*/
#define	DMA_TSR057	(DMA_TSR57)

/** \brief  1EE8, DMA Transaction State Register */
#define DMA_TSR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE8u)

/** Alias (User Manual Name) for DMA_TSR58.
* To use register names with standard convension, please use DMA_TSR58.
*/
#define	DMA_TSR058	(DMA_TSR58)

/** \brief  1EEC, DMA Transaction State Register */
#define DMA_TSR59 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EECu)

/** Alias (User Manual Name) for DMA_TSR59.
* To use register names with standard convension, please use DMA_TSR59.
*/
#define	DMA_TSR059	(DMA_TSR59)

/** \brief  1E18, DMA Transaction State Register */
#define DMA_TSR6 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E18u)

/** Alias (User Manual Name) for DMA_TSR6.
* To use register names with standard convension, please use DMA_TSR6.
*/
#define	DMA_TSR006	(DMA_TSR6)

/** \brief  1EF0, DMA Transaction State Register */
#define DMA_TSR60 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF0u)

/** Alias (User Manual Name) for DMA_TSR60.
* To use register names with standard convension, please use DMA_TSR60.
*/
#define	DMA_TSR060	(DMA_TSR60)

/** \brief  1EF4, DMA Transaction State Register */
#define DMA_TSR61 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF4u)

/** Alias (User Manual Name) for DMA_TSR61.
* To use register names with standard convension, please use DMA_TSR61.
*/
#define	DMA_TSR061	(DMA_TSR61)

/** \brief  1EF8, DMA Transaction State Register */
#define DMA_TSR62 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF8u)

/** Alias (User Manual Name) for DMA_TSR62.
* To use register names with standard convension, please use DMA_TSR62.
*/
#define	DMA_TSR062	(DMA_TSR62)

/** \brief  1EFC, DMA Transaction State Register */
#define DMA_TSR63 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EFCu)

/** Alias (User Manual Name) for DMA_TSR63.
* To use register names with standard convension, please use DMA_TSR63.
*/
#define	DMA_TSR063	(DMA_TSR63)

/** \brief  1F00, DMA Transaction State Register */
#define DMA_TSR64 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F00u)

/** Alias (User Manual Name) for DMA_TSR64.
* To use register names with standard convension, please use DMA_TSR64.
*/
#define	DMA_TSR064	(DMA_TSR64)

/** \brief  1F04, DMA Transaction State Register */
#define DMA_TSR65 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F04u)

/** Alias (User Manual Name) for DMA_TSR65.
* To use register names with standard convension, please use DMA_TSR65.
*/
#define	DMA_TSR065	(DMA_TSR65)

/** \brief  1F08, DMA Transaction State Register */
#define DMA_TSR66 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F08u)

/** Alias (User Manual Name) for DMA_TSR66.
* To use register names with standard convension, please use DMA_TSR66.
*/
#define	DMA_TSR066	(DMA_TSR66)

/** \brief  1F0C, DMA Transaction State Register */
#define DMA_TSR67 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F0Cu)

/** Alias (User Manual Name) for DMA_TSR67.
* To use register names with standard convension, please use DMA_TSR67.
*/
#define	DMA_TSR067	(DMA_TSR67)

/** \brief  1F10, DMA Transaction State Register */
#define DMA_TSR68 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F10u)

/** Alias (User Manual Name) for DMA_TSR68.
* To use register names with standard convension, please use DMA_TSR68.
*/
#define	DMA_TSR068	(DMA_TSR68)

/** \brief  1F14, DMA Transaction State Register */
#define DMA_TSR69 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F14u)

/** Alias (User Manual Name) for DMA_TSR69.
* To use register names with standard convension, please use DMA_TSR69.
*/
#define	DMA_TSR069	(DMA_TSR69)

/** \brief  1E1C, DMA Transaction State Register */
#define DMA_TSR7 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E1Cu)

/** Alias (User Manual Name) for DMA_TSR7.
* To use register names with standard convension, please use DMA_TSR7.
*/
#define	DMA_TSR007	(DMA_TSR7)

/** \brief  1F18, DMA Transaction State Register */
#define DMA_TSR70 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F18u)

/** Alias (User Manual Name) for DMA_TSR70.
* To use register names with standard convension, please use DMA_TSR70.
*/
#define	DMA_TSR070	(DMA_TSR70)

