Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_TSR93.
* To use register names with standard convension, please use DMA_TSR93.
*/
#define	DMA_TSR093	(DMA_TSR93)

/** \brief  1F78, DMA Transaction State Register */
#define DMA_TSR94 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F78u)

/** Alias (User Manual Name) for DMA_TSR94.
* To use register names with standard convension, please use DMA_TSR94.
*/
#define	DMA_TSR094	(DMA_TSR94)

/** \brief  1F7C, DMA Transaction State Register */
#define DMA_TSR95 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F7Cu)

/** Alias (User Manual Name) for DMA_TSR95.
* To use register names with standard convension, please use DMA_TSR95.
*/
#define	DMA_TSR095	(DMA_TSR95)

/** \brief  1F80, DMA Transaction State Register */
#define DMA_TSR96 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F80u)

/** Alias (User Manual Name) for DMA_TSR96.
* To use register names with standard convension, please use DMA_TSR96.
*/
#define	DMA_TSR096	(DMA_TSR96)

/** \brief  1F84, DMA Transaction State Register */
#define DMA_TSR97 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F84u)

/** Alias (User Manual Name) for DMA_TSR97.
* To use register names with standard convension, please use DMA_TSR97.
*/
#define	DMA_TSR097	(DMA_TSR97)

/** \brief  1F88, DMA Transaction State Register */
#define DMA_TSR98 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F88u)

/** Alias (User Manual Name) for DMA_TSR98.
* To use register names with standard convension, please use DMA_TSR98.
*/
#define	DMA_TSR098	(DMA_TSR98)

/** \brief  1F8C, DMA Transaction State Register */
#define DMA_TSR99 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F8Cu)

/** Alias (User Manual Name) for DMA_TSR99.
* To use register names with standard convension, please use DMA_TSR99.
*/
#define	DMA_TSR099	(DMA_TSR99)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMA_REG_H */
